{"12c03ff982d25361": {"terms": ["data science", "data engineer"], "salary_min": 75000.0, "salary_max": 114000.0, "title": "Geospatial Data Engineer", "company": "Gevo, Inc.", "desc": "About the role: \n  The team at Gevo works with experts in software engineering and data science. sustainability, agronomy, carbon accounting, and data science to help farmers create new value for sustainable practices. We are looking for a team member with excellent geospatial programming, analytics, and data engineering skills for the position of Geospatial Agronomist, Data Engineer. To be successful in this role you will:  \n \n Lead the overall geospatial data management program  \n Design scalable processes and programs to help acquire, organize, analyze, and display layered and temporal geospatial data sets.  \n Be the interface with both growers and external partners to lead collection and transfer of field and crop management boundaries files and other shapefiles from the farm into Verity Tracking.  \n Conduct manual (and developing automated processes for the) clean-up, corrections, and adjustments of geometries as well as attributional data, to fit into the platforms overall data flow.  \n Review, compare, validate, and normalize naming and acreage discrepancies between in-platform maps, USDA shapefiles, and third-party shapefiles.  \n Ensure maps are of acceptable quality and format with the appropriate tract, field, and farm boundaries demarcated.  \n Manage geospatial data associated with projects related to remote sensing, including data acquisition, processing, analysis, and storytelling with data.  \n Integrating remote sensing data with GIS databases and other geospatial information to provide an integrated and comprehensive understanding of the area(s) of interest.  \n Work with the data science and sustainability teams to analyze and interpret remote sensing data. This includes identifying features, objects, characteristics, and patterns within the imagery, such as land cover classification, vegetation indices, change detection, and anomaly detection.  \n Resolve problems by assisting, coaching, and training dealers/distributors on technical problem investigation and solution implementation.  \n Present and promote data management best practices to retailers, agronomy partners, and farmers.  \n Collaborate with the data engineering and data science teams to build automated geospatial workflows.  \n Identification of geospatial trends and insights to solve key tactical and strategic business problems  \n Write clean, testable, and modularized code  \n Work with key stakeholders to identify opportunities to enhance the flow, analysis, and presentation of multiple different geospatial data sets into and across the company  \n Transparently communicate priorities, obstacles, and progress on a regular basis to the Product, Sustainability, and Marketing teams.  \n Comfortably lead technical geospatial operations while following agile principles \n \n Who you are: \n \n \n Degree or equivalent experience in a quantitative field such as data science, data analytics, geospatial engineering, or computer science; with applied experience in technical geospatial data implementation (programming and visualization)  \n Expert in common geospatial platforms and programming languages such as Python and proficient with data management systems (e.g. ArcGis, GEOJSON etc.)  \n Experience with databases / SQL dialects is preferred  \n Experience in agriculture sales and/or business development and/or crop production preferred.  \n Comfortable in data validation, verification, and quality assurance methods for geospatial data - strong analytical skills and an eye for detail are crucial for fulfilling your duties.  \n Logic-driven critical thinker committed to accuracy, precision, and increasing understanding though geospatial data visualization.  \n Strong ability to manage projects, ask the right questions, and propose product solutions.  \n Passionate about environmental sustainability with domain knowledge in agricultural practices, industrial processes, and data.  \n Experienced in building trusted business relationships.  \n Customer-oriented, with a demonstrated ability to respect and earn the respect of farmers and retail distribution partners  \n Strong written and verbal communicator  \n Enjoy attending farm shows to promote the use of products and services  \n Proficient at managing time, priorities, and expenses.  \n Self-starter, reliable, and able to work independently.  \n Computer Skills: To perform this job successfully, an individual should be proficient in Google Suite applications (and similar office suites).  \n \n Who We Are \n \n We are People First  \n We are Mission-Focused  \n We are Agile  \n We are Innovators \n \n What Gevo Offers You   \n \n Free health, dental, vision, life and disability insurance for employee and family  \n 21 days of paid time off plus 10 paid holidays  \n 401k contribution plan  \n Annual incentive plan, based on Company performance  \n Paid community service time  \n Dog friendly office  \n Be part of a smart, high performing, passionate team  \n Work-from-home stipend, if remote \n \n Commitment to Diversity and Inclusion \n \n  Gevo, Inc. is an equal opportunity employer that is committed to diversity and inclusion in the workplace. We prohibit discrimination and harassment of any kind based on race, color, sex, religion, sexual orientation, national origin, disability, genetic information, pregnancy, or any other protected characteristic as outlined by federal, state, or local laws."}, "06850f402d81c27a": {"terms": ["data science", "data engineer"], "salary_min": 102665.52, "salary_max": 129997.43, "title": "Senior Data Engineer", "company": "S5 Stratos", "desc": "At S5, we are on a mission to make Advanced Data Science consumable to Business Users. S5 is a SaaS software provider of AI/ML-powered products which transform planning and decision making capabilities across the digital supply chain for the Retail and CPG industries. \n To support our aggressive growth, we are actively seeking talent (at multiple levels) to join our team. \n The Role: \n S5 Stratos is seeking an experienced Sr. Data Engineer, capable of creating and optimizing a scalable, resilient, and event-driven data pipeline architecture through our cloud-based solutions. \n The right person will have a proven ability to innovate, work across a variety of APIs and databases, and maintain a comprehensive catalog of all data streams, data mapping, and data integration solutions. The right fit will embrace the challenge and opportunity of an informal, fast-paced startup environment with a flat organizational structure. \n What You’ll Do: \n \n Develop and automate large scale, high-performance data processing systems (batch and/or streaming) \n Translate business needs into data models: implement data strategies, build data flows and develop conceptual data models. \n Implement deployment and infrastructure automation strategies. \n Build data support for our experimentation efforts, solving problems from statistical test automation to building real-time M/L pipelines \n Automate manual processes, optimize data delivery, and re-design infrastructure for greater scalability. \n Promote data modeling standardization, define, and drive adoption of the standards. \n Build analytics and reporting tools that utilize the data pipeline to provide results and business value to make data-driven decisions. \n Maintain and improve upon our existing ETL pipeline \n Perform routine maintenance tasks and upgrades of our server architecture \n Work with stakeholders to assist with data-related technical issues and support data infrastructure needs. \n Apply best practices for testing and deployment in an agile environment. \n Contribute to shared Data Engineering tooling & standards to improve engineering productivity across the company \n \n Requirements \n What We’re Looking For: \n \n Expert-level understanding of relational databases (columnar and row-based) \n Expertise in SQL is a must. \n Prior experience working with Tier-1 technology consulting firms is a huge plus \n Proven hands-on experience building complex ETLs in a business environment with large-scale, complex datasets \n Scripting experience in python and bash shell required \n Fully proficient in pipeline building and job automations \n Proficiency with Git \n Experience building RESTful APIs \n Experience with error handling and data validation \n Experience working in GCP or other cloud platforms \n Bachelors in Computer Science, Engineering or similar \n Must be eligible to work in the US. \n \n Benefits \n What’s in it for You? \n At S5, you will get an opportunity to truly innovate while working with some of the smartest brains in the industry to solve existing and emerging business problems. Additionally, you will play a key role in defining the next generation work culture and work ethic to solve problems that others thought - simply impossible. \n There’s never been a more exciting time to join our team! \n Job Type: Full-time \n Job Type: Full-time \n Benefits: \n \n Dental insurance \n Health insurance \n Paid time off \n Vision insurance \n \n Schedule: \n \n Monday to Friday \n \n Education: \n \n Bachelor's (Required) \n \n Work Location: Remote"}, "d6b937844dd05916": {"terms": ["data science"], "salary_min": 68882.0, "salary_max": 88921.0, "title": "Associate Digital Producer", "company": "Infor", "desc": "General information \n       \n \n \n \n \n \n \n        Country \n        \n United States  \n \n \n \n        City \n        \n Remote Location  \n \n \n \n        Department \n        \n Infor Design  \n \n \n \n        Job ID \n        \n 37437  \n \n \n \n \n \n \n \n \n \n       Description & Requirements \n       \n \n \n \n \n \n \n \n In this role, you’ll be a key member of the Infor Design communications team. You’ll help create and manage content and schedules for our growing publishing program, which includes the development and curation of educational content for design.infor.com, developer.infor.com, corporate SharePoint and Wiki platforms, a fledgling podcast, and more. You’ll coordinate the creation of engaging communications and effective best practices about product design and user experience for Infor’s employees and select external audiences. \n   \n \n A Day in The Life Typically Includes: \n \n \n \n Create and maintain content calendars, communications plans, project schedules, and technical requirements \n Oversee day-to-day routing/review among content, design, and development teams \n Create, manage, and publish a variety of digital content \n Monitor project statuses and deadlines; managing expectations, promptly communicating, and solving issues (escalating, if needed) \n Schedule status and review meetings, taking notes and driving to next steps \n Track website/communications performance metrics \n Fulfill other administrative or operational duties, as needed \n \n \n \n Basic Qualifications: \n \n \n \n Experience in content creation, publishing, creative management, production, or a related area \n Experience creating and updating content for websites, emails, blogs, video, and/or social \n Experience working with content management systems (WordPress), project management tools (Jira) and Microsoft 365 product suite \n Experience proofreading and editing \n Must be able to work in EST \n \n \n \n Preferred Qualifications: \n \n Familiarity with technology, product design, enterprise software, and/or user experience \n Bachelor’s degree in communications, editorial, marketing, or a related area \n Experience creating and managing a podcast \n \n \n \n For California, Colorado, New York and Washington applicants, we anticipate paying between $68,882- $88,921 per year. You may also be offered discretionary variable compensation [or target commission of $8,508 depending on the role]. Please note that the salary information is a general guideline only. In addition, Infor provides a variety of benefits to employees, including health insurance coverage, an employee wellness program, life and disability insurance, a retirement savings plan, paid holidays and paid time off (PTO). \n \n  US Remote (Dallas, TX/St. Paul, MN/Alpharetta, GA) \n \n \n \n \n \n \n \n \n \n         About Infor\n         \n \n \n  Infor is a global leader in business cloud software products for companies in industry specific markets. Infor builds complete industry suites in the cloud and efficiently deploys technology that puts the user experience first, leverages data science, and integrates easily into existing systems. Over 60,000 organizations worldwide rely on Infor to help overcome market disruptions and achieve business-wide digital transformation.\n         \n \n          For more information visit www.infor.com\n         \n \n \n \n \n \n \n \n         Our Values\n         \n \n \n  At Infor, we strive for an environment that is founded on a business philosophy called Principle Based Management™ (PBM™) and eight Guiding Principles: integrity, stewardship & compliance, transformation, principled entrepreneurship, knowledge, humility, respect, self-actualization. Increasing diversity is important to reflect our markets, customers, partners, and communities we serve in now and in the future.\n         \n \n \n  We have a relentless commitment to a culture based on PBM. Informed by the principles that allow a free and open society to flourish, PBM™ prepares individuals to innovate, improve, and transform while fostering a healthy, growing organization that creates long-term value for its clients and supporters and fulfillment for its employees.\n         \n \n \n  Infor is an Equal Opportunity Employer. We are committed to creating a diverse and inclusive work environment. Infor does not discriminate against candidates or employees because of their sex, race, gender identity, disability, age, sexual orientation, religion, national origin, veteran status, or any other protected status under the law.\n          \n \n \n \n \n         At Infor we value your privacy that’s why we created a policy that you can read here.\n         \n \n \n \n \n \n \n \n \n         This employer uses E-Verify. Please visit the following website for additional information: www.kochcareers.com/doc/Everify.pdf"}, "d3078a2845f9547e": {"terms": ["data science", "data analyst"], "salary_min": 129927.54, "salary_max": 164517.22, "title": "Lead Business Intelligence Analyst (East Coast)", "company": "Rivian", "desc": "About Rivian: \n  \n   Rivian is on a mission to keep the world adventurous forever. This goes for the emissions-free Electric Adventure Vehicles we build, and the curious, courageous souls we seek to attract.\n  \n \n \n  As a company, we constantly challenge what’s possible, never simply accepting what has always been done. We reframe old problems, seek new solutions and operate comfortably in areas that are unknown. Our backgrounds are diverse, but our team shares a love of the outdoors and a desire to protect it for future generations.\n   Role Summary: \n  \n   Rivian is seeking a detail oriented, data driven root cause problem solver with the technical chops to shed light on the performance and productivity, among other critical aspects, of the Commercial Operations organization.\n   Responsibilities: \n  \n Be a key member of a high caliber Commercial Operations Business Intelligence team that generates insight into operational performance, recommends solutions to enable the overall performance of Commercial Ops and upstream partners.  \n Examine key business data by identifying, cleaning, and providing analysis and insights, validating data fidelity and creating data where none currently exists.  \n Developing tools that deliver insights to stakeholders, automate workflows, and improve data accuracy. \n  Build dashboards, tools, and predictive models for business groups to help visualize or monitor data in areas like operations, sales, performance, and/or customer engagement. Providing ongoing data mining efforts to key in on trends and areas of continuous improvement \n  Generate insights and present findings to senior management using data visualization and presentation programs to suggest business recommendations \n  Key partners to collaborate with include Manufacturing & Engineering, Various Operations Teams, Finance & Accounting, People Team, Strategy, Marketing \n  Qualifications: \n  \n Master’s degree in Statistics, Data Science, Operations Research/Industrial Engineering Mathematics or related technical field required \n  Proficiency in Python and SQL \n  Proficiency in visualization tools - Tableau \n  Familiarity with AWS and Data bricks preferred. \n  5+ years of experience as an Analyst – supporting Sales or Business Operations – Consulting experience a plus. \n  Analytical framework project manager preferred \n  Company Statements: \n  Equal Opportunity \n \n   Rivian is an equal opportunity employer and complies with all applicable federal, state, and local fair employment practices laws. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, ancestry, sex, sexual orientation, gender, gender expression, gender identity, genetic information or characteristics, physical or mental disability, marital/domestic partner status, age, military/veteran status, medical condition, or any other characteristic protected by law.\n  \n \n \n  Rivian is committed to ensuring that our hiring process is accessible for persons with disabilities. If you have a disability or limitation, such as those covered by the Americans with Disabilities Act, that requires accommodations to assist you in the search and application process, please email us at candidateaccommodations@rivian.com.\n  \n  Candidate Data Privacy \n \n   Rivian may collect, use and disclose your personal information or personal data (within the meaning of the applicable data protection laws) when you apply for employment and/or participate in our recruitment processes (“Candidate Personal Data”). This data includes contact, demographic, communications, educational, professional, employment, social media/website, network/device, recruiting system usage/interaction, security and preference information. Rivian may use your Candidate Personal Data for the purposes of (i) tracking interactions with our recruiting system; (ii) carrying out, analyzing and improving our application and recruitment process, including assessing you and your application and conducting employment, background and reference checks; (iii) establishing an employment relationship or entering into an employment contract with you; (iv) complying with our legal, regulatory and corporate governance obligations; (v) recordkeeping; (vi) ensuring network and information security and preventing fraud; and (vii) as otherwise required or permitted by applicable law.\n  \n \n \n  Rivian may share your Candidate Personal Data with (i) internal personnel who have a need to know such information in order to perform their duties, including individuals on our People Team, Finance, Legal, and the team(s) with the position(s) for which you are applying; (ii) Rivian affiliates; and (iii) Rivian’s service providers, including providers of background checks, staffing services, and cloud services.\n  \n \n \n  Rivian may transfer or store internationally your Candidate Personal Data, including to or in the United States, Canada, the United Kingdom, and the European Union and in the cloud, and this data may be subject to the laws and accessible to the courts, law enforcement and national security authorities of such jurisdictions.\n  \n \n \n  Please note that we are currently not accepting applications from third party application services."}, "35f3200e2fae9d8a": {"terms": ["data science"], "salary_min": 150300.0, "salary_max": 180000.0, "title": "Senior Data Scientist, Data Products", "company": "Spokeo", "desc": "Spokeo is a people search engine and identity platform that both enlightens and empowers our customers. With nearly 15 billion records and 18 million monthly visitors, we reconnect friends, reunite families, prevent fraud, and more. \n \n  We are looking for a  Senior Data Scientist  to help us turn our vast repository of data into usable information, leveraging solutions that include matching techniques, machine learning, and graph theory to resolve entities across disparate data sets and discover relationships among those entities. \n \n  What You'll Do:  This includes an estimate of where time will be spent. This is subject to change: \n \n  25% - Drive informed and timely decision-making that improves and optimizes the way our products are created, executed, and adopted. \n 20% - Collaborate with product, marketing, and engineering to understand the needs of the company by utilizing data to drive product decisions and strategy. \n 15% - Create automated anomaly detection systems and quality assurance metrics to track performance constantly. \n 15% - Communicate best practices in quantitative analysis and develop cross-functional partnerships. \n 15% - Perform Ad-hoc analysis and present results. \n 10% - Keep up to date with the latest technology trends to apply them to our business challenges. \n \n \n  Requirements: \n \n  Advanced degree in Machine Learning, Computer Science, Engineering, Statistics, Applied Math, or other quantitative fields. \n Minimum of 3 years of any internet or large B2C working experience in analytics, data mining, data visualization, and/or predictive modeling. \n Proficiency in working with SQL and Python \n Excellent communication and collaboration skills with the ability to work effectively with internal teams in a cross-cultural and cross-functional environment \n Proven ability to lead and execute projects from start to finish with minimal guidance in a fast-paced environment. \n Ability to create visuals, dashboards, and reports to communicate insights effectively. \n \n \n  Named  Best Company for 2023  by Comparably in the areas of  Perks & Benefits, Happiness, Compensation, and Work-Life Balance . \n \n  Spokeo offers a bonus program, equity plans, and 401K matching for qualified roles. Twice a year, we do discretionary, merit-based salary increases. Additional benefits include; 100% medical/dental/vision coverage for all employees and unlimited PTO. \n \n  Spokeo extends written offers to candidates who successfully complete their selection process. Spokeo’s offers include a base salary, participation in a company bonus program, stock options, and comprehensive benefits. A final offer will depend on several factors, including, but not limited to, marketplace competition, job leveling, the candidate’s experience, skills, etc. \n \n  Privacy Notice for Candidates: https://www.spokeo.com/recruiting-policy \n \n  Spokeo is an equal opportunity employer. Applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, or protected veteran status. Spokeo fosters a business culture where ideas and decisions from all people help us grow, innovate, create the best products, and be relevant in a rapidly changing world. \n \n  Recruiters or staffing agencies: Spokeo is not obligated to compensate any external recruiter or search firm who presents a candidate or their resume or profile to a Spokeo employee without 1) a current, fully-executed agreement on file, and 2) being assigned to the open position (as a search) via our applicant tracking solution. \n \n  #LI-DNI \n  This is a remote position."}, "f4f12a735ed4b200": {"terms": ["data science"], "salary_min": 165000.0, "salary_max": 232000.0, "title": "Data Scientist, Product Analytics", "company": "Facebook App", "desc": "As a Data Scientist at Meta, you will shape the future of people-facing and business-facing products we build across our entire family of applications (Facebook, Instagram, Messenger, WhatsApp, Oculus). By applying your technical skills, analytical mindset, and product intuition to one of the richest data sets in the world, you will help define the experiences we build for billions of people and hundreds of millions of businesses around the world. You will collaborate on a wide array of product and business problems with a diverse set of cross-functional partners across Product, Engineering, Research, Data Engineering, Marketing, Sales, Finance and others. You will use data and analysis to identify and solve product development’s biggest challenges. You will influence product strategy and investment decisions with data, be focused on impact, and collaborate with other teams. By joining Meta, you will become part of a world-class analytics community dedicated to skill development and career growth in analytics and beyond.Product leadership: You will use data to shape product development, quantify new opportunities, identify upcoming challenges, and ensure the products we build bring value to people, businesses, and Meta. You will help your partner teams prioritize what to build, set goals, and understand their product’s ecosystem.Analytics: You will guide teams using data and insights. You will focus on developing hypotheses and employ a diverse toolkit of rigorous analytical approaches, different methodologies, frameworks, and technical approaches to test them.Communication and influence: You won’t simply present data, but tell data-driven stories. You will convince and influence your partners using clear insights and recommendations. You will build credibility through structure and clarity, and be a trusted strategic partner.\n  \n \n \n Data Scientist, Product Analytics Responsibilities:    \n \n Work with large and complex data sets to solve a wide array of challenging problems using different analytical and statistical approaches. \n  Apply technical expertise with quantitative analysis, experimentation, data mining, and the presentation of data to develop strategies for our products that serve billions of people and hundreds of millions of businesses. \n  Identify and measure success of product efforts through goal setting, forecasting, and monitoring of key product metrics to understand trends. \n  Define, understand, and test opportunities and levers to improve the product, and drive roadmaps through your insights and recommendations. \n  Partner with Product, Engineering, and cross-functional teams to inform, influence, support, and execute product strategy and investment decisions. \n \n \n \n \n Minimum Qualifications:   \n \n  A minimum of 6 years of work experience in analytics (minimum of 4 years with a Ph.D.) \n  Bachelor's degree in Mathematics, Statistics, a relevant technical field, or equivalent practical experience. \n  Experience with data querying languages (e.g. SQL), scripting languages (e.g. Python), and/or statistical/mathematical software (e.g. R) \n \n \n \n \n Preferred Qualifications:   \n \n  Masters or Ph.D. Degree in a quantitative field. \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "d3c2214373f327e8": {"terms": ["data science"], "salary_min": 165000.0, "salary_max": 232000.0, "title": "Data Scientist, Product Analytics - Monetization", "company": "Facebook App", "desc": "As a Monetization focused Data Scientist at Meta, you will have the opportunity to help people and businesses make meaningful connections and build premium services across our entire family of applications (Facebook, Instagram, Messenger, WhatsApp, Reality Labs). By applying your technical skills, analytical mindset, and product intuition to one of the richest data sets in the world, you will help define the experiences we build for billions of people and hundreds of millions of businesses around the world, and change the way they connect and communicate. You will collaborate on a wide array of product and business problems with a diverse set of cross-functional partners across Product, Engineering, Research, Data Engineering, Marketing, Sales, Finance and others. You will use data and analysis to identify and solve product development’s biggest challenges. You will influence product strategy and investment decisions with data, be focused on impact, and collaborate with other teams. By joining Meta, you will become part of a world-class analytics community dedicated to skill development and career growth in analytics and beyond.Product leadership: You will use data to shape product development, quantify new opportunities, identify upcoming challenges, and ensure the products we build bring value to people, businesses, and Meta. You will help your partner teams prioritize what to build, set goals, and understand their product’s ecosystem.Analytics: You will guide teams using data and insights. You will focus on developing hypotheses and employ a diverse toolkit of rigorous analytical approaches, different methodologies, frameworks, and technical approaches to test them.Communication and influence: You won’t simply present data, but tell data-driven stories. You will convince and influence your partners using clear insights and recommendations. You will build credibility through structure and clarity, and be a trusted strategic partner.\n  \n \n \n Data Scientist, Product Analytics - Monetization Responsibilities:    \n \n Work with large and complex data sets to solve a wide array of challenging problems using different analytical and statistical approaches. \n  Apply technical expertise with quantitative analysis, experimentation, data mining, and the presentation of data to develop strategies for our products that serve billions of people and hundreds of millions of businesses. \n  Identify and measure success of product efforts through goal setting, forecasting, and monitoring of key product metrics to understand trends. \n  Define, understand, and test opportunities and levers to improve the product, and drive roadmaps through your insights and recommendations. \n  Partner with Product, Engineering, and cross-functional teams to inform, influence, support, and execute product strategy and investment decisions. \n \n \n \n \n Minimum Qualifications:   \n \n  A minimum of 6 years of work experience in analytics (minimum of 4 years with a Ph.D.) \n  Bachelor's degree in Mathematics, Statistics, a relevant technical field, or equivalent practical experience. \n  Experience with data querying languages (e.g. SQL), scripting languages (e.g. Python), and/or statistical/mathematical software (e.g. R) \n \n \n \n \n Preferred Qualifications:   \n \n  Masters or Ph.D. Degree in a quantitative field. \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "af3e12d564ae4d74": {"terms": ["data science"], "salary_min": 139668.06, "salary_max": 176850.9, "title": "Software Engineer, Sr. Principal", "company": "Infor", "desc": "General information \n       \n \n \n \n \n \n \n        Country \n        \n United States  \n \n \n \n        City \n        \n Remote Location  \n \n \n \n        Department \n        \n Development  \n \n \n \n        Job ID \n        \n 37377  \n \n \n \n \n \n \n \n \n \n       Description & Requirements \n       \n \n \n \n \n \n \n \n         Infor is looking for a talented engineer to join our enterprise scale Data Persistence team. Infor relies on its Landmark Platform to develop and run large scale multi-tenant SaaS enterprise applications on Amazon Web Services (AWS).\n         \n \n \n  The Data Persistence layer provides management and interaction of data created by Landmark’s domain specific language (DSL) named the Landmark Pattern Language (LPL). The team’s tooling allows zero down time updates for multi-tenant systems. This engineering position will be responsible for building, testing, and maintaining infrastructure and tools. In addition, this position will be responsible for enhancing the object relational mapping layer for the application tier and implementation of tooling to support the build and release of the Landmark domain specific language platform. The main tools to use and support include Java, Perl, Ant, Gradle, AWS, Groovy, SQL Server, PostgreSQL, Jira, Git, Confluence, and JFrog.\n         \n \n \n  Key Responsibilities\n         \n \n \n \n \n  Deep structural coding for builds of domain specific language \n  Expand test driven development layers and capabilities \n  Highly organized with the ability to triage and prioritize issues on your own \n  Debug complex issues involving multiple stakeholders and technologies \n  Development Processes (Daily Team Collaboration, Planning, Backlog Refinement , Demos) \n  Delivering long-term solutions that result in higher developer productivity and quality \n  Day to day development to enhance development tooling \n \n \n \n \n  Basic Qualifications\n         \n \n \n \n \n  Experience working in an AWS environment and using services like EC2, S3, Lambda, Aurora, Autoscaling, EFS, EBS, Cloudfront \n  Experience as a Developer tool maker \n  Experience with Java/Perl \n  Experience working in a test driven development environment \n \n \n \n \n  Preferred Qualifications\n         \n \n \n \n \n  Gradle experience \n  Jira and Confluence experience \n  Experience working in small teams but interacting with many external stakeholders / customers \n  Experience with rapid prototyping and iterative development \n  Bachelors Degree in Computer Science or related field \n \n \n           Job Location: US Remote (Alpharetta, GA, Dallas, TX, St. Paul, MN)\n          \n \n \n \n \n \n \n \n \n \n         About Infor\n         \n \n \n  Infor is a global leader in business cloud software products for companies in industry specific markets. Infor builds complete industry suites in the cloud and efficiently deploys technology that puts the user experience first, leverages data science, and integrates easily into existing systems. Over 60,000 organizations worldwide rely on Infor to help overcome market disruptions and achieve business-wide digital transformation.\n         \n \n          For more information visit www.infor.com\n         \n \n \n \n \n \n \n \n         Our Values\n         \n \n \n  At Infor, we strive for an environment that is founded on a business philosophy called Principle Based Management™ (PBM™) and eight Guiding Principles: integrity, stewardship & compliance, transformation, principled entrepreneurship, knowledge, humility, respect, self-actualization. Increasing diversity is important to reflect our markets, customers, partners, and communities we serve in now and in the future.\n         \n \n \n  We have a relentless commitment to a culture based on PBM. Informed by the principles that allow a free and open society to flourish, PBM™ prepares individuals to innovate, improve, and transform while fostering a healthy, growing organization that creates long-term value for its clients and supporters and fulfillment for its employees.\n         \n \n \n  Infor is an Equal Opportunity Employer. We are committed to creating a diverse and inclusive work environment. Infor does not discriminate against candidates or employees because of their sex, race, gender identity, disability, age, sexual orientation, religion, national origin, veteran status, or any other protected status under the law.\n          \n \n \n \n \n         At Infor we value your privacy that’s why we created a policy that you can read here.\n         \n \n \n \n \n \n \n \n \n         This employer uses E-Verify. Please visit the following website for additional information: www.kochcareers.com/doc/Everify.pdf"}, "6a9525c154c2d072": {"terms": ["data science"], "salary_min": 116000.0, "salary_max": 168000.0, "title": "Fundamental Language Research Scientist - Generative AI", "company": "Meta", "desc": "Meta is seeking a Research Scientist to join our new Large Language Model (LLM) Research team. We are looking for recognized experts in generative AI and NLP, with experience in areas like language model evaluation; data processing for pretraining and fine-tuning; responsible LLMs; LLM alignment; reinforcement learning for language model tuning; efficient training and inference; and/or multilingual and multimodal modeling. The ideal candidate will have an interest in producing and applying new science to help us develop and deploy large language models.\n  \n \n \n Fundamental Language Research Scientist - Generative AI Responsibilities:    \n \n Lead, collaborate, and execute on research that pushes forward the state of the art in large language model research. \n  Directly contribute to experiments, including designing experimental details, writing reusable code, running evaluations, and organizing results. \n  Work with a large and globally distributed team. \n  Contribute to publications and open-sourcing efforts. \n  Help identify long-term ambitious research goals as well as intermediate milestones. \n  Prioritize research that can be applied to Meta's product development. \n  Mentor other team members. Play a significant role in healthy cross-functional collaboration. \n \n \n \n \n Minimum Qualifications:   \n \n  Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. \n  A PhD in AI, computer science, data science, or related technical fields. \n  Experience holding an industry, faculty, or government researcher position. \n  Publications in machine learning. \n  Experience writing software and executing complex experiments involving large AI models and datasets. \n  Must obtain work authorization in the country of employment at the time of hire, and maintain ongoing work authorization during employment. \n  Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta. \n \n \n \n \n Preferred Qualifications:   \n \n  Direct experience in generative AI and LLM research. \n  2+ year(s) of work experience in a university, industry, or government lab, in a role with primary emphasis on AI research. \n  First author publications experience at peer-reviewed AI conferences (e.g., NeurIPS, CVPR, ICML, ICLR, ICCV, and ACL). \n  Experience in developing and debugging in Python. \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "7674a68c9688d145": {"terms": ["data science", "machine learning engineer"], "salary_min": 143000.0, "salary_max": 204000.0, "title": "Security Engineer, Insider Trust", "company": "Meta", "desc": "As part of Facebook Security, our Insider Trust team is focused on identifying and responding to insider threats to data. The team's mission is to identify malicious use of otherwise legitimate access to data from people inside the company and respond to it before damage is done. We investigate across a broad spectrum of abuse including abuse of user data, intellectual property, and leaks of sensitive information. We collaborate with software engineering teams to build advanced detection capabilities and understand how abuse happens so that we can stay ahead of those who are interested in misusing their access. \n   The Insider Trust team is looking for a highly motivated Security Engineer to build and improve internal tools and systems to detect malicious activities related to insider threats. Candidates are expected to analyze and monitor internal tools, hunt for insider threats against company data and infrastructure, and and have the ability to carry out complex internal investigations from collection to reporting. As part of the role, this person will work side by side with our engineering teams to build advanced detection solutions to help keep systems and information safe, and partner closely with our Human Resources and Legal teams to carry out complex investigations. We are looking for people that have a strong technical background, experience with computer forensics, data analytics, system and network administration, and the ability to build tools and/or automate tasks.\n  \n \n \n \n Security Engineer, Insider Trust Responsibilities:    \n \n Lead cross-functional projects to improve our capabilities to effectively detect and respond to internal threats and security incidents \n  Leverage threat modeling and analysis to build event and/or behavioral based detections to protect our critical assets and infrastructure \n  Perform analysis of logs from a variety of sources (e.g., individual host logs, network traffic logs) to identify potential insider threats \n  Build operational workflows and actions that auto-resolve false positives and provide context scaling our ability to investigate \n  Identify gaps in our infrastructure, and work with software engineers, product managers, and business partners to gain visibility through logging and detection \n  Perform live response, digital forensics, and analysis of a wide variety of assets including endpoints, mobile, servers and networking equipment \n  Conduct insider trust investigations in a cross-functional environment and drive incident resolution \n \n \n \n \n Minimum Qualifications:   \n \n  Bachelor's degree in Computer Science, Engineering, or equivalent experience \n  Experience writing detection rules using event or anomaly based methods \n  Experience conducting technical security investigations (response, forensics, log analysis) \n  2+ years experience interpreting information from multiple sources and working with data sets \n  Knowledge with database tools/systems such as Hbase, SQL, HQL \n  Knowledge of the security domain, as well as focus in one (or more) areas, such as:\n    \n  Data science, analytics, machine learning experience applicable to the insider threat detection space \n  Host forensics with knowledge of forensic artifacts, operating systems, and incident response experience (including live response) for Windows, MacOS, Linux, iOS and/or Android \n  Tool development for threat detection and/or incident response \n \n \n \n \n \n Preferred Qualifications:   \n \n  Master's degree in Computer Science/Engineering \n  Coding proficiency in Python, PHP, and/or C++, Pandas, NumPy, Scikit-learn, TensorFlow \n  Networking and system administration experience of server (Linux, Windows) and client (Windows, macOS, Linux) operating systems \n  Familiarity with multiple forensic tools (e.g. SIFT Workstation, Sleuthkit, F-Response Enterprise, EnCase, FTK, Cellebrite, X-Ways, Volatility, or open source tools) to perform analysis and/or memory collection \n  Experience with anomaly detection applicable to the insider threat detection space \n  3+ years incident response experience \n  3+ years of insider threat experience \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "dca43db70cbee168": {"terms": ["data science", "machine learning engineer"], "salary_min": 143000.0, "salary_max": 204000.0, "title": "Research Engineer, Language - Generative AI", "company": "Meta", "desc": "Meta is seeking a Research Engineer to join our Large Language Model (LLM) Research team. We conduct focused research and engineering to build state-of-the-art LLMs, which we often open-source, like our team’s recent Llama 2. We are looking for strong engineers who have a background in generative AI and NLP, with experience in areas like language model evaluation; data processing for pre-training and fine-tuning; responsible LLMs; LLM alignment; reinforcement learning for language model tuning; efficient training and inference; and/or multilingual and multimodal modeling.\n  \n \n \n Research Engineer, Language - Generative AI Responsibilities:    \n \n Design methods, tools, and infrastructure to push forward the state of the art in large language models. \n  Define research goals informed by practical engineering concerns. \n  Contribute to experiments, including designing experimental details, writing reusable code, running evaluations, and organizing results. \n  Adapt standard machine learning methods to best exploit modern parallel environments (e.g. distributed clusters, multicore SMP, and GPU). \n  Work with a large and globally distributed team. \n  Contribute to publications and open-sourcing efforts. \n \n \n \n \n Minimum Qualifications:   \n \n  Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. \n  Research experience in machine learning, deep learning, and/or natural language processing. \n  Experience with developing machine learning models at scale from inception to business impact. \n  Programming experience in Python and hands-on experience with frameworks such as PyTorch. \n  Exposure to architectural patterns of large scale software applications. \n  Must obtain work authorization in the country of employment at the time of hire, and maintain ongoing work authorization during employment. \n \n \n \n \n Preferred Qualifications:   \n \n  Master's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. \n  A PhD in AI, computer science, data science, or related technical fields. \n  Direct experience in generative AI and LLM research. \n  First author publications at peer-reviewed AI conferences (e.g., NeurIPS, CVPR, ICML, ICLR, ICCV, and ACL). \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "92350ad04c6c159f": {"terms": ["data science"], "salary_min": 125577.805, "salary_max": 159009.48, "title": "Senior Lifecycle Marketing Manager", "company": "TextNow", "desc": "We believe communication belongs to everyone. We exist to democratize phone service. TextNow is evolving the way the world connects and that's because we're made up of people with curious minds who bring an optimistic, yet critical lens into the work we do. We're the largest provider of free phone service in the nation. And we're just getting started.\n   \n \n \n \n \n  Join us in our mission to break down barriers to communication and free the flow of conversation for people everywhere.\n   \n \n \n \n \n  We are seeking a dynamic and results-driven Senior Lifecycle Marketing Manager to join our team at TextNow. In this role, you will be the primary Lifecycle Marketing partner to our Monetization team, and you’llbe responsible for planning and executing innovative marketing strategies across CRM channels. You will collaborate closely with our Product, Sales, Data Science and Analytics teams, leveraging data-driven insights to deliver measurable results. This position reports to the Director of Lifecycle Marketing and offers an exciting opportunity to join a dynamic team, drive innovation, and scale our efforts.\n  \n What You'll Do \n \n  Own KPIs, end-to-end strategy, execution, and reporting for lifecycle marketing initiatives across CRM channels (push, in-app, interstitials, emails, ads)to support our Monetization vertical. \n  Identify untapped cross-sell/upsell opportunities to drive adoption of Monetization features, in-app purchases, and partnerships, including ourbrand-new productTextNow Perks. \n  Build and oversee a multi-channel testing roadmap and seasonal calendar, offering insights to drive continuous improvements (with a rapid test, learn, optimize approach). \n  Partner with Product,Sales and Engineering teams to support feature and partnership launches. \n  Provide insights from a lifecycle marketing perspective to guide ad-revenue strategy and decisions to enhance the product experience. \n  Partner with Design and Data Science teams to create top-notch assets for lifecycle marketing campaigns, delivering a personalized journey across multiple touchpoints. \n \n  Who You Are \n \n  6+ years of experience in managing CRM channels including expertisein app-first channels such as push notifications, in-app messaging, and interstitials. \n  Strong grasp of both technical (use of ESPs)and business aspects of CRM is essential. Prior experience withtools such as Braze, Iterable, andLeanPlumis highly desirable. \n  Proficient in data analysis and reporting (comfortable with Excel, able to make decisions using data). \n  A natural team player, with a strong track record of cross-functional partnership. \n  Deep understanding of customer behavior and the ability to develop effective segmentation and personalization strategies. \n  Excellent written and verbal communication skills. \n  Strong attention to detail, and a no-task-too-small mentality. \n  BA, preferably in related fields of marketing or business. \n \n \n  More about TextNow...   \n \n \n \n \n Our Values:  \n \n \n People First  (Make business decisions by putting people first!) \n No Brilliant Jerks  (We're cool with the brilliant part, with the jerk part? not so much) \n Give a Damn!  (We care about our work, our mission and our customers) \n Challenge Accepted  (Show up with a positive can-do attitude) \n \n \n \n  Benefits, Culture, & More:  \n \n \n Strong work life blend \n Flexible work arrangements (wfh, remote, or access to one of our office spaces)  \n Employee Stock Options \n Unlimited vacation \n Competitive pay and benefits \n Parental leave \n Benefits for both physical and mental well being (wellness credit and L&D credit)  \n We travel a few times a year for various team events, company wide off-sites, and more \n \n \n \n  Diversity and Inclusion: \n \n \n  At TextNow, our mission is built around inclusion and offering a service for EVERYONE, in an industry that traditionally only caters to the few who have the means to afford it. We believe that diversity of thought and inclusion of others promotes a greater feeling of belonging and higher levels of engagement. We know that if we work together, we can do amazing things, and that our differences are what make our product and company great. \n \n \n \n  TextNow Candidate Policy \n \n \n  By submitting an application to TextNow, you agree to the collection, use, and disclosure of your personal information in accordance with the  \n TextNow Candidate Policy"}, "00675d86bbe6cb5b": {"terms": ["data science"], "salary_min": 123170.586, "salary_max": 155961.4, "title": "Senior Lifecycle Marketing Manager", "company": "TextNow", "desc": "We believe communication belongs to everyone. We exist to democratize phone service. TextNow is evolving the way the world connects and that's because we're made up of people with curious minds who bring an optimistic, yet critical lens into the work we do. We're the largest provider of free phone service in the nation. And we're just getting started.\n   \n \n \n \n \n  Join us in our mission to break down barriers to communication and free the flow of conversation for people everywhere.\n   \n \n \n \n \n  We are seeking a dynamic and results-driven Senior Lifecycle Marketing Manager to join our team at TextNow. In this role, you will be the primary Lifecycle Marketing partner to our Monetization team, and you’llbe responsible for planning and executing innovative marketing strategies across CRM channels. You will collaborate closely with our Product, Sales, Data Science and Analytics teams, leveraging data-driven insights to deliver measurable results. This position reports to the Director of Lifecycle Marketing and offers an exciting opportunity to join a dynamic team, drive innovation, and scale our efforts.\n  \n What You'll Do \n \n  Own KPIs, end-to-end strategy, execution, and reporting for lifecycle marketing initiatives across CRM channels (push, in-app, interstitials, emails, ads)to support our Monetization vertical. \n  Identify untapped cross-sell/upsell opportunities to drive adoption of Monetization features, in-app purchases, and partnerships, including ourbrand-new productTextNow Perks. \n  Build and oversee a multi-channel testing roadmap and seasonal calendar, offering insights to drive continuous improvements (with a rapid test, learn, optimize approach). \n  Partner with Product,Sales and Engineering teams to support feature and partnership launches. \n  Provide insights from a lifecycle marketing perspective to guide ad-revenue strategy and decisions to enhance the product experience. \n  Partner with Design and Data Science teams to create top-notch assets for lifecycle marketing campaigns, delivering a personalized journey across multiple touchpoints. \n \n  Who You Are \n \n  6+ years of experience in managing CRM channels including expertisein app-first channels such as push notifications, in-app messaging, and interstitials. \n  Strong grasp of both technical (use of ESPs)and business aspects of CRM is essential. Prior experience withtools such as Braze, Iterable, andLeanPlumis highly desirable. \n  Proficient in data analysis and reporting (comfortable with Excel, able to make decisions using data). \n  A natural team player, with a strong track record of cross-functional partnership. \n  Deep understanding of customer behavior and the ability to develop effective segmentation and personalization strategies. \n  Excellent written and verbal communication skills. \n  Strong attention to detail, and a no-task-too-small mentality. \n  BA, preferably in related fields of marketing or business. \n \n \n  More about TextNow...   \n \n \n \n \n Our Values:  \n \n \n People First  (Make business decisions by putting people first!) \n No Brilliant Jerks  (We're cool with the brilliant part, with the jerk part? not so much) \n Give a Damn!  (We care about our work, our mission and our customers) \n Challenge Accepted  (Show up with a positive can-do attitude) \n \n \n \n  Benefits, Culture, & More:  \n \n \n Strong work life blend \n Flexible work arrangements (wfh, remote, or access to one of our office spaces)  \n Employee Stock Options \n Unlimited vacation \n Competitive pay and benefits \n Parental leave \n Benefits for both physical and mental well being (wellness credit and L&D credit)  \n We travel a few times a year for various team events, company wide off-sites, and more \n \n \n \n  Diversity and Inclusion: \n \n \n  At TextNow, our mission is built around inclusion and offering a service for EVERYONE, in an industry that traditionally only caters to the few who have the means to afford it. We believe that diversity of thought and inclusion of others promotes a greater feeling of belonging and higher levels of engagement. We know that if we work together, we can do amazing things, and that our differences are what make our product and company great. \n \n \n \n  TextNow Candidate Policy \n \n \n  By submitting an application to TextNow, you agree to the collection, use, and disclosure of your personal information in accordance with the  \n TextNow Candidate Policy"}, "3e24a3200597010c": {"terms": ["data science"], "salary_min": 125562.195, "salary_max": 158989.72, "title": "Senior Lifecycle Marketing Manager", "company": "TextNow", "desc": "We believe communication belongs to everyone. We exist to democratize phone service. TextNow is evolving the way the world connects and that's because we're made up of people with curious minds who bring an optimistic, yet critical lens into the work we do. We're the largest provider of free phone service in the nation. And we're just getting started.\n   \n \n \n \n \n  Join us in our mission to break down barriers to communication and free the flow of conversation for people everywhere.\n   \n \n \n \n \n  We are seeking a dynamic and results-driven Senior Lifecycle Marketing Manager to join our team at TextNow. In this role, you will be the primary Lifecycle Marketing partner to our Monetization team, and you’llbe responsible for planning and executing innovative marketing strategies across CRM channels. You will collaborate closely with our Product, Sales, Data Science and Analytics teams, leveraging data-driven insights to deliver measurable results. This position reports to the Director of Lifecycle Marketing and offers an exciting opportunity to join a dynamic team, drive innovation, and scale our efforts.\n  \n What You'll Do \n \n  Own KPIs, end-to-end strategy, execution, and reporting for lifecycle marketing initiatives across CRM channels (push, in-app, interstitials, emails, ads)to support our Monetization vertical. \n  Identify untapped cross-sell/upsell opportunities to drive adoption of Monetization features, in-app purchases, and partnerships, including ourbrand-new productTextNow Perks. \n  Build and oversee a multi-channel testing roadmap and seasonal calendar, offering insights to drive continuous improvements (with a rapid test, learn, optimize approach). \n  Partner with Product,Sales and Engineering teams to support feature and partnership launches. \n  Provide insights from a lifecycle marketing perspective to guide ad-revenue strategy and decisions to enhance the product experience. \n  Partner with Design and Data Science teams to create top-notch assets for lifecycle marketing campaigns, delivering a personalized journey across multiple touchpoints. \n \n  Who You Are \n \n  6+ years of experience in managing CRM channels including expertisein app-first channels such as push notifications, in-app messaging, and interstitials. \n  Strong grasp of both technical (use of ESPs)and business aspects of CRM is essential. Prior experience withtools such as Braze, Iterable, andLeanPlumis highly desirable. \n  Proficient in data analysis and reporting (comfortable with Excel, able to make decisions using data). \n  A natural team player, with a strong track record of cross-functional partnership. \n  Deep understanding of customer behavior and the ability to develop effective segmentation and personalization strategies. \n  Excellent written and verbal communication skills. \n  Strong attention to detail, and a no-task-too-small mentality. \n  BA, preferably in related fields of marketing or business. \n \n \n  More about TextNow...   \n \n \n \n \n Our Values:  \n \n \n People First  (Make business decisions by putting people first!) \n No Brilliant Jerks  (We're cool with the brilliant part, with the jerk part? not so much) \n Give a Damn!  (We care about our work, our mission and our customers) \n Challenge Accepted  (Show up with a positive can-do attitude) \n \n \n \n  Benefits, Culture, & More:  \n \n \n Strong work life blend \n Flexible work arrangements (wfh, remote, or access to one of our office spaces)  \n Employee Stock Options \n Unlimited vacation \n Competitive pay and benefits \n Parental leave \n Benefits for both physical and mental well being (wellness credit and L&D credit)  \n We travel a few times a year for various team events, company wide off-sites, and more \n \n \n \n  Diversity and Inclusion: \n \n \n  At TextNow, our mission is built around inclusion and offering a service for EVERYONE, in an industry that traditionally only caters to the few who have the means to afford it. We believe that diversity of thought and inclusion of others promotes a greater feeling of belonging and higher levels of engagement. We know that if we work together, we can do amazing things, and that our differences are what make our product and company great. \n \n \n \n  TextNow Candidate Policy \n \n \n  By submitting an application to TextNow, you agree to the collection, use, and disclosure of your personal information in accordance with the  \n TextNow Candidate Policy"}, "cb758015ff85f67f": {"terms": ["data science"], "salary_min": 120292.26, "salary_max": 152316.8, "title": "Senior Lifecycle Marketing Manager", "company": "TextNow", "desc": "We believe communication belongs to everyone. We exist to democratize phone service. TextNow is evolving the way the world connects and that's because we're made up of people with curious minds who bring an optimistic, yet critical lens into the work we do. We're the largest provider of free phone service in the nation. And we're just getting started.\n   \n \n \n \n \n  Join us in our mission to break down barriers to communication and free the flow of conversation for people everywhere.\n   \n \n \n \n \n  We are seeking a dynamic and results-driven Senior Lifecycle Marketing Manager to join our team at TextNow. In this role, you will be the primary Lifecycle Marketing partner to our Monetization team, and you’llbe responsible for planning and executing innovative marketing strategies across CRM channels. You will collaborate closely with our Product, Sales, Data Science and Analytics teams, leveraging data-driven insights to deliver measurable results. This position reports to the Director of Lifecycle Marketing and offers an exciting opportunity to join a dynamic team, drive innovation, and scale our efforts.\n  \n What You'll Do \n \n  Own KPIs, end-to-end strategy, execution, and reporting for lifecycle marketing initiatives across CRM channels (push, in-app, interstitials, emails, ads)to support our Monetization vertical. \n  Identify untapped cross-sell/upsell opportunities to drive adoption of Monetization features, in-app purchases, and partnerships, including ourbrand-new productTextNow Perks. \n  Build and oversee a multi-channel testing roadmap and seasonal calendar, offering insights to drive continuous improvements (with a rapid test, learn, optimize approach). \n  Partner with Product,Sales and Engineering teams to support feature and partnership launches. \n  Provide insights from a lifecycle marketing perspective to guide ad-revenue strategy and decisions to enhance the product experience. \n  Partner with Design and Data Science teams to create top-notch assets for lifecycle marketing campaigns, delivering a personalized journey across multiple touchpoints. \n \n  Who You Are \n \n  6+ years of experience in managing CRM channels including expertisein app-first channels such as push notifications, in-app messaging, and interstitials. \n  Strong grasp of both technical (use of ESPs)and business aspects of CRM is essential. Prior experience withtools such as Braze, Iterable, andLeanPlumis highly desirable. \n  Proficient in data analysis and reporting (comfortable with Excel, able to make decisions using data). \n  A natural team player, with a strong track record of cross-functional partnership. \n  Deep understanding of customer behavior and the ability to develop effective segmentation and personalization strategies. \n  Excellent written and verbal communication skills. \n  Strong attention to detail, and a no-task-too-small mentality. \n  BA, preferably in related fields of marketing or business. \n \n \n  More about TextNow...   \n \n \n \n \n Our Values:  \n \n \n People First  (Make business decisions by putting people first!) \n No Brilliant Jerks  (We're cool with the brilliant part, with the jerk part? not so much) \n Give a Damn!  (We care about our work, our mission and our customers) \n Challenge Accepted  (Show up with a positive can-do attitude) \n \n \n \n  Benefits, Culture, & More:  \n \n \n Strong work life blend \n Flexible work arrangements (wfh, remote, or access to one of our office spaces)  \n Employee Stock Options \n Unlimited vacation \n Competitive pay and benefits \n Parental leave \n Benefits for both physical and mental well being (wellness credit and L&D credit)  \n We travel a few times a year for various team events, company wide off-sites, and more \n \n \n \n  Diversity and Inclusion: \n \n \n  At TextNow, our mission is built around inclusion and offering a service for EVERYONE, in an industry that traditionally only caters to the few who have the means to afford it. We believe that diversity of thought and inclusion of others promotes a greater feeling of belonging and higher levels of engagement. We know that if we work together, we can do amazing things, and that our differences are what make our product and company great. \n \n \n \n  TextNow Candidate Policy \n \n \n  By submitting an application to TextNow, you agree to the collection, use, and disclosure of your personal information in accordance with the  \n TextNow Candidate Policy"}, "fa58176a1c4a009a": {"terms": ["data science"], "salary_min": 134000.0, "salary_max": 194000.0, "title": "Data Scientist, Product Analytics", "company": "Facebook App", "desc": "As a Data Scientist at Meta, you will shape the future of people-facing and business-facing products we build across our entire family of applications (Facebook, Instagram, Messenger, WhatsApp, Oculus). By applying your technical skills, analytical mindset, and product intuition to one of the richest data sets in the world, you will help define the experiences we build for billions of people and hundreds of millions of businesses around the world. You will collaborate on a wide array of product and business problems with a diverse set of cross-functional partners across Product, Engineering, Research, Data Engineering, Marketing, Sales, Finance and others. You will use data and analysis to identify and solve product development’s biggest challenges. You will influence product strategy and investment decisions with data, be focused on impact, and collaborate with other teams. By joining Meta, you will become part of a world-class analytics community dedicated to skill development and career growth in analytics and beyond.Product leadership: You will use data to shape product development, quantify new opportunities, identify upcoming challenges, and ensure the products we build bring value to people, businesses, and Meta. You will help your partner teams prioritize what to build, set goals, and understand their product’s ecosystem.Analytics: You will guide teams using data and insights. You will focus on developing hypotheses and employ a diverse toolkit of rigorous analytical approaches, different methodologies, frameworks, and technical approaches to test them.Communication and influence: You won’t simply present data, but tell data-driven stories. You will convince and influence your partners using clear insights and recommendations. You will build credibility through structure and clarity, and be a trusted strategic partner.\n  \n \n \n Data Scientist, Product Analytics Responsibilities:    \n \n Work with large and complex data sets to solve a wide array of challenging problems using different analytical and statistical approaches. \n  Apply technical expertise with quantitative analysis, experimentation, data mining, and the presentation of data to develop strategies for our products that serve billions of people and hundreds of millions of businesses. \n  Identify and measure success of product efforts through goal setting, forecasting, and monitoring of key product metrics to understand trends. \n  Define, understand, and test opportunities and levers to improve the product, and drive roadmaps through your insights and recommendations. \n  Partner with Product, Engineering, and cross-functional teams to inform, influence, support, and execute product strategy and investment decisions. \n \n \n \n \n Minimum Qualifications:   \n \n  Bachelor's degree in Mathematics, Statistics, a relevant technical field, or equivalent practical experience. \n  A minimum of 4 years of work experience in analytics (minimum of 2 years with a Ph.D.) \n  Experience with data querying languages (e.g. SQL), scripting languages (e.g. Python), and/or statistical/mathematical software (e.g. R) \n \n \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "a773824e0fe72c57": {"terms": ["data science"], "salary_min": 116002.0, "salary_max": 168000.0, "title": "Software Engineer, Machine Learning", "company": "Meta", "desc": "Meta is embarking on the most transformative change to its business and technology in company history, and our Machine Learning Engineers are at the forefront of this evolution. By leading crucial projects and initiatives that have never been done before, you have an opportunity to help us advance the way people connect around the world.The ideal candidate will have industry experience working on a range of recommendation, classification, and optimization problems. You will bring the ability to own the whole ML life-cycle, define projects and drive excellence across teams. You will work alongside the world’s leading engineers and researchers to solve some of the most exciting and massive social data and prediction problems that exist on the web.\n  \n \n \n Software Engineer, Machine Learning Responsibilities:    \n \n Develop highly scalable classifiers and tools leveraging machine learning, data regression, and rules based models \n  Suggest, collect and synthesize requirements and create effective feature roadmap \n  Code deliverables in tandem with the engineering team \n  Adapt standard machine learning methods to best exploit modern parallel environments (e.g. distributed clusters, multicore SMP, and GPU) \n \n \n \n \n Minimum Qualifications:   \n \n  2+ years of experience in one or more of the following areas: machine learning, recommendation systems, pattern recognition, data mining or artificial intelligence \n  Proven experience to translate insights into business recommendations \n  Experience with Hadoop/HBase/Pig or MapReduce/Sawzall/Bigtable \n  Knowledge developing and debugging in C/C++ and Java \n  Experience with scripting languages such as Perl, Python, PHP, and shell scripts \n  Currently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta. \n \n \n \n \n Preferred Qualifications:   \n \n  Exposure to architectural patterns of large scale software applications \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "9546d7beb6fec437": {"terms": ["data science", "data engineer"], "salary_min": 134000.0, "salary_max": 194000.0, "title": "Data Engineer, Product Analytics", "company": "Meta", "desc": "As a highly collaborative organization, our data engineers work cross-functionally with software engineering, data science, and product management to optimize growth, strategy, and experience for our 3 billion plus users, as well as our internal employee community. In this role, you will see a direct correlation between your work, company growth, and user satisfaction. Beyond this, you will work with some of the brightest minds in the industry, and you'll have a unique opportunity to solve some of the most interesting data challenges with efficiency and integrity, at a scale few companies can match.\n  \n \n \n Data Engineer, Product Analytics Responsibilities:    \n \n Conceptualize and own the data architecture for multiple large-scale projects, while evaluating design and operational cost-benefit tradeoffs within systems \n  Create and contribute to frameworks that improve the efficacy of logging data, while working with data infrastructure to triage issues and resolve \n  Collaborate with engineers, product managers, and data scientists to understand data needs, representing key data insights in a meaningful way \n  Define and manage SLA for all data sets in allocated areas of ownership \n  Determine and implement the security model based on privacy requirements, confirm safeguards are followed, address data quality issues, and evolve governance processes within allocated areas of ownership \n  Design, build, and launch collections of sophisticated data models and visualizations that support multiple use cases across different products or domains \n  Solve our most challenging data integration problems, utilizing optimal ETL patterns, frameworks, query techniques, sourcing from structured and unstructured data sources \n  Assist in owning existing processes running in production, optimizing complex code through advanced algorithmic concepts \n  Optimize pipelines, dashboards, frameworks, and systems to facilitate easier development of data artifacts \n  Influence product and cross-functional teams to identify data opportunities to drive impact \n  Mentor team members by giving/receiving actionable feedback \n \n \n \n \n Minimum Qualifications:   \n \n  Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. \n  4+ years of work experience in data engineering (a minimum of 2+ years with a Ph.D) \n  Experience with SQL, ETL, data modeling, and at least one programming language (e.g., Python, C++, C#, Scala, etc.) \n \n \n \n \n Preferred Qualifications:   \n \n  Master's or Ph.D degree in a STEM field \n  Experience with one or more of the following: data processing automation, data quality, data warehousing, data governance, business intelligence, data visualization, data privacy \n  Experience working with terabyte to petabyte scale data \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "d3959671abbb764b": {"terms": ["data science"], "salary_min": 172994.0, "salary_max": 241000.0, "title": "Software Engineer, Machine Learning", "company": "Meta", "desc": "Meta is embarking on the most transformative change to its business and technology in company history, and our Machine Learning Engineers are at the forefront of this evolution. By leading crucial projects and initiatives that have never been done before, you have an opportunity to help us advance the way people connect around the world. The ideal candidate will have industry experience working on a range of recommendation, classification, and optimization problems. You will bring the ability to own the whole ML life cycle, define projects and drive excellence across teams. You will work alongside the world’s leading engineers and researchers to solve some of the most exciting and massive social data and prediction problems that exist on the web.\n  \n \n \n Software Engineer, Machine Learning Responsibilities:    \n \n Play a critical role in setting the direction and goals for a sizable team, in terms of project impact, ML system design, and ML excellence \n  Adapt standard machine learning methods to best exploit modern parallel environments (e.g., distributed clusters, multicore SMP, and GPU) \n  Re-evaluate the tradeoffs of already shipped features/ML systems, and you are able to drive large efforts across multiple teams to reduce technical debt, designing from first principles when appropriate \n  Leading a team from a technical perspective to develop ML best practices and influence engineering culture \n  Be a go-to person to escalate the most complex online/production performance and evaluation issues, that require an in depth knowledge of how the machine learning system interacts with systems around it \n  Develop highly scalable classifiers and tools leveraging machine learning, data regression, and rules based models \n  Suggest, collect and synthesize requirements and create effective feature roadmap \n  Code deliverables in tandem with the engineering team \n \n \n \n \n Minimum Qualifications:   \n \n  6+ years of experience in software engineering, or a relevant field. 4+ years of experience if you have a PhD \n  2+ years of experience in one or more of the following areas: machine learning, recommendation systems, pattern recognition, data mining, artificial intelligence, or related technical field \n  Experience with developing machine learning models at scale from inception to business impact \n  Knowledge developing and debugging in C/C++ and Java, or experience with scripting languages such as Python, Perl, PHP, and/or shell scripts \n  Experience demonstrating technical leadership working with teams, owning projects, defining and setting technical direction for projects \n  Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. \n \n \n \n \n Preferred Qualifications:   \n \n  Masters degree or PhD in Computer Science or a related technical field \n  Exposure to architectural patterns of large scale software applications \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "6c9a33a41a3ac7b5": {"terms": ["data science"], "salary_min": 205000.0, "salary_max": 281000.0, "title": "Software Engineer (Technical Leadership) - Machine Learning", "company": "Meta", "desc": "Meta is seeking Machine Learning Engineers to join our engineering team. The ideal candidate will have industry experience working on a range of classification and optimization problems like payment fraud, click-through rate prediction, click-fraud detection, search ranking, text/sentiment classification, collaborative filtering/recommendation, or spam detection. The position will involve taking these skills and applying them to some of the most exciting and massive social data and prediction problems that exist on the web.\n  \n \n \n Software Engineer (Technical Leadership) - Machine Learning Responsibilities:    \n \n Drive the team's goals & technical direction to pursue opportunities that make your larger organization more efficient \n  Effectively communicate complex features & systems in detail \n  Understand industry & company-wide trends to help assess & develop new technologies \n  Partner & collaborate with organization leaders to help improve the level of performance of the team & organization \n  Identify new opportunities for the larger organization & influence the appropriate people for staffing/prioritizing these new ideas \n  Suggest, collect and synthesize requirements and create an effective feature roadmap \n  Develop highly scalable classifiers and tools leveraging machine learning, data regression, and rules-based models \n  Adapt standard machine learning methods to best exploit modern parallel environments (e.g. distributed clusters, multicore SMP, and GPU) \n \n \n \n \n Minimum Qualifications:   \n \n  Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. \n  Experience leading projects with industry-wide impact \n  Experience communicating and working across functions to drive solutions \n  Experience in mentoring/influencing senior engineers across organizations \n  Proven track record of planning multi-year roadmap in which short-term projects ladder to the long-term vision \n  Experience in driving large cross-functional/industry-wide engineering efforts \n  12+ years of experience in programming languages (Python, C++, Java or R) with technical background \n  8+ years of experience in one or more of the following areas: machine learning, recommendation systems, pattern recognition, NLP, data mining or artificial intelligence \n \n \n \n \n Preferred Qualifications:   \n \n  Experience in shipping products to millions of customers or have started a new line of product \n  Experience with Hadoop/HBase/Pig or MapReduce/Sawzall/Bigtable/Hive/Spark \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "682e3fe64d70e10a": {"terms": ["data science", "data engineer"], "salary_min": 93755.78, "salary_max": 118715.7, "title": "Data Engineer", "company": "IQVIA", "desc": "Location:  Home-based in the U.S. or Canada \n \n  Summary:  IQVIA is seeking an experienced Data Engineer to join an Advanced Analytics group within the Clinical Data Science department. Work in our team that is dedicated to the long-term efforts of a prominent Pharmaceutical company. Work fully within the environment of the Pharma. As a Data Engineer, you will play a crucial role in transforming raw data into meaningful insights that drive decision-making and innovation. You will work closely with a team of data scientists and other data engineers in a fast-paced, collaborative environment. \n  Responsibilities: \n \n  SQL Query Assistance: Assist data scientists in crafting SQL queries to extract data from individual or multiple, large databases. This includes feature engineering, where new, model-useful features are derived from database records through operations like summing or counting. \n  Optimizing Database and Query Performance: Develop materialized views and implement indexing strategies to enhance query speed and ensure efficient execution of application-specific queries. Write efficient queries that don’t require materialized view creation when possible. \n  Data Quality Monitoring: Help establish a robust data quality monitoring framework for early detection and resolution of data quality issues following bulk data loads. \n  Data Mastery Enhancement: Collaborate with fellow data engineers to boost data mastery regarding critical dimensions across input data sources feeding into the integrated data model. This includes tasks such as address cleaning, completion, standardization, fuzzy string matching, and other advanced methods of preparing records and merging them when they are equivalent across sources. \n  Database Documentation Maintenance: Maintain and develop comprehensive database documentation for other users and data scientists. \n \n \n  Qualifications:  \n \n Bachelor's degree or higher in Computer Science, Data Science, or related field. \n  Proven experience as a Data Engineer, Software Developer, Data Scientist.  \n Strong knowledge of SQL, database structures, schema design, and query tuning principles, and practices. Extensive experience with Postgresql, specifically, is desired. \n  Familiarity with Python is also necessary. \n  Familiarity with data quality monitoring and data preparation techniques. \n  Familiarity with the pharmaceutical industry and clinical data is a strong plus, but it is not required. \n  Excellent problem-solving skills and attention to detail. \n  Strong communication skills and ability to work collaboratively in a team-oriented environment. \n \n \n  IQVIA is a leading global provider of advanced analytics, technology solutions and clinical research services to the life sciences industry. We believe in pushing the boundaries of human science and data science to make the biggest impact possible – to help our customers create a healthier world. Learn more at https://jobs.iqvia.com \n \n  We are committed to providing equal employment opportunities for all, including veterans and candidates with disabilities. https://jobs.iqvia.com/eoe \n \n  IQVIA’s ability to operate and provide certain services to customers and partners necessitates IQVIA and its employees meet specific requirements regarding COVID-19 vaccination status. https://jobs.iqvia.com/covid-19-vaccine-status"}, "7e64e8c1817628a7": {"terms": ["data analyst"], "salary_min": 40000.0, "salary_max": 60000.0, "title": "Data Analyst", "company": "Makana Technologies", "desc": "About us \n We are revolutionizing marketing for consumer products. \n We are looking for someone who wants to be an early employee of a fast growing startup. The job will be 100% remote and you will be working directly with the Co-Founders. \n ```Duties``` - Collecting, analyzing, and interpreting complex data sets to identify trends, patterns, and insights - Developing and implementing data collection systems and strategies - Cleaning and transforming raw data into a usable format for analysis - Creating and maintaining databases and data systems - Collaborating with cross-functional teams to define project objectives and deliverables - Conducting statistical analysis and modeling to support business decision-making - Presenting findings to stakeholders in a clear and concise manner - Developing data visualizations and dashboards to effectively communicate insights \n Note: This job description is not intended to be all-inclusive. The employee may perform other related duties as negotiated to meet the ongoing needs of the organization. \n Job Types: Full-time, Contract \n Pay: $40,000.00 - $60,000.00 per year \n Language: \n \n English (Required) \n \n Work Location: Remote"}, "d003354d58111197": {"terms": ["data analyst"], "salary_min": 80809.66, "salary_max": 102323.03, "title": "Data Analyst", "company": "Citizens", "desc": "Description \n  Citizens Financial Group, Inc. (CFG) seeks a Data Analyst for its Westwood, MA location. \n  Duties: Formulates and applies quantitative analytics and optimization methods to design, develop, and implement visualization dashboards. Utilizes Tableau Desktop to facilitate the interpretation and analysis of management information. Develops insights and solutions aligned with strategic initiatives through actionable, accessible, and understandable data visualizations. Analyzes and defines data flows and dependencies and makes recommendations to improve data extraction and presentation methods. Refines and grows reporting and analysis capabilities. Designs and implements business intelligence solutions, including requirements gathering, design, development, solution delivery, and end-user training. Uses knowledge of Agile processes to develop custom reports and data visualization products using large data sets. Engineers dashboards, backend SQL servers, and data queries to enable efficient methods for editing SQL Server databases, tracking inventories, monitoring data sources, and providing full-stack systems. Utilizes agile project management and source code repository to track project-level bugs and manage environmental issue tracking. \n  Requirements: Master’s degree in Business, Engineering, Information Systems, or related field and 1 (one) year of experience, gained either through industry experience or graduate level academic studies. At least one (1) year of experience must include: Using BI and analytical tools, including Tableau, to develop innovative and insightful data visualizations; Utilizing Data Exploratory Analysis to make complex data more accessible, understandable, and usable; Utilizing mathematical logical principles to analyze and define tasks, data flow, and dependencies; and Improving data presentation methods and systems using data analytics to refine and grow reporting and analysis capabilities. Experience must also include: Utilizing SQL Server databases to track inventories and monitor data sources; Engineering dashboards, backend SQL servers, and data queries to enable efficient SQL server editing, inventory tracking, and data source monitoring; Utilizing agile project management and source code repositories to track project-level bugs and manage environmental issue tracking; Designing and implementing business intelligence solutions, including conducting requirements gathering, designing, development, solutions delivery, and end-user training; Using business intelligence tools, including Tableau, Alteryx, and MS SQL Server, to fulfill reporting needs and identifying solutions that provide business value; and Developing custom reports and data visualization products using large data sets to transform data into actionable insights. \n  May telecommute from any U.S. location. \n  Direct applicants only. \n Some job boards have started using jobseeker-reported data to estimate salary ranges for roles. If you apply and qualify for this role, a recruiter will discuss accurate pay guidance. \n  Equal Employment Opportunity \n  At Citizens we value diversity, equity and inclusion, and treat everyone with respect and professionalism. Employment decisions are based solely on experience, performance, and ability. Citizens, its parent, subsidiaries, and related companies (Citizens) provide equal employment and advancement opportunities to all colleagues and applicants for employment without regard to age, ancestry, color, citizenship, physical or mental disability, perceived disability or history or record of a disability, ethnicity, gender, gender identity or expression (including transgender individuals who are transitioning, have transitioned, or are perceived to be transitioning to the gender with which they identify), genetic information, genetic characteristic, marital or domestic partner status, victim of domestic violence, family status/parenthood, medical condition, military or veteran status, national origin, pregnancy/childbirth/lactation, colleague’s or a dependent’s reproductive health decision making, race, religion, sex, sexual orientation, or any other category protected by federal, state and/or local laws. \n  Equal Employment and Opportunity Employer \n  Citizens is a brand name of Citizens Bank, N.A. and each of its respective affiliates. \n \n  Why Work for Us \n  At Citizens, you'll find a customer-centric culture built around helping our customers and giving back to our local communities. When you join our team, you are part of a supportive and collaborative workforce, with access to training and tools to accelerate your potential and maximize your career growth"}, "72d5b835ddb4937b": {"terms": ["data analyst"], "salary_min": 60322.434, "salary_max": 76381.64, "title": "Pension Risk Annuity New Business Analyst / Advanced", "company": "Mutual of Omaha", "desc": "Location:  Various Locations   Work Type:  Full Time Regular   Job No:  502714   Categories:  Finance/Accounting, Customer Service, Underwriting   Application Closes:  Closes Nov 20, 2023 \n \n \n \n \n \n \n      The Retirement Plans Underwriting Department has an immediate opening for Pension Risk Annuity New Business Analyst who will facilitate the onboarding process for the institutional retirement income annuity cases for new and existing customers focusing on Pension Risk Transfer product.\n      \n \n \n \n \n WHAT WE CAN OFFER YOU: \n \n Estimated Salary (Levels have variable responsibilities and qualifications), plus annual bonus opportunity. \n         \n Sr. Analyst: Minimum: $56,150 MidPoint: $72,810 Maximum: $89,470, plus annual bonus opportunity. \n Advanced Analyst: Minimum: $65,000 MidPoint: $84,000 Maximum: $103,000, plus annual bonus opportunity. \n \n 401(k) plan with a 2% company contribution and 6% company match. \n Regular associates working 40 hours a week can earn up to 15 days of vacation each year. \n Regular associates receive 9 paid holidays in 2023. \n Regular associates are provided sick leave through the use of personal time. Associates working 40 hours a week can receive up to 56 hours of personal time in 2023, prorated based on the start date. \n \n \n \n \n \n \n \n WHAT YOU'LL DO: \n \n Analyzes and reconciles data related to the sold institutional retirement income annuities, primarily in the pension risk transfer market. \n Assists managers and producers in properly submitting data requirements on group and individual annuity sold cases. \n Develops detailed annuity final benefit reports and assists producers and plans to finalize the installation of the sold case. \n Conducts research in order to secure additional data needed to make determinations on pricing and installation. \n Develops and maintains a good working relationship and rapport with internal and external business partners. Communicates with clients, producers and other sources concerning pricing guidelines, decisions and procedures. \n \n \n \n \n \n \n \n WHAT YOU’LL BRING: \n \n Seasoned knowledge with retirement plans, products, design, administration and regulatory requirements. Proficient computer skills using various software packages including Excel spreadsheet. \n Attention to detail with strong planning and organizational skills. \n Ability to work accurately and efficiently in a fast-paced environment. \n Strong interpersonal skills, communication skills (written and verbal) and negotiation skills. \n Strong mathematical and financial aptitude for understanding pricing strategies and their potential impact on financial results. \n You promote a culture of diversity and inclusion, value different ideas and opinions, and listen courageously, remaining curious in all that you do. \n Able to work remotely with access to a high-speed internet connection and located in the United States or Puerto Rico. \n \n \n \n \n \n \n \n VALUABLE EXPERIENCE: \n \n Bachelor's degree preferred or 4-7 years of annuity underwriting experience. \n \n \n \n \n \n \n \n We value diverse experience, skills, and passion for innovation. If your experience aligns with the listed requirements, please apply! \n  If you have questions about your application or the hiring process, email our Talent Acquisition area at careers@mutualofomaha.com. Please allow at least one week from time of applying if you are checking on the status. \n  #circa \n \n \n \n \n \n \n \n Help: careers@mutualofomaha.com"}, "b7451e9e1fa0b855": {"terms": ["data analyst"], "salary_min": null, "salary_max": null, "title": "Electronic Processing Business Analyst", "company": "Work from Home", "desc": "Introduction \n  Do you want to join an organization that invests in you as a Electronic Processing Business Analyst? At Work from Home, you come first. HCA Healthcare has committed up to $300 million in programs to support our incredible team members over the course of three years. \n  Benefits \n  Work from Home, offers a total rewards package that supports the health, life, career and retirement of our colleagues. The available plans and programs include: \n \n  Comprehensive medical coverage that covers many common services at no cost or for a low copay. Plans include prescription drug and behavioral health coverage as well as free telemedicine services and free AirMed medical transportation. \n  Additional options for dental and vision benefits, life and disability coverage, flexible spending accounts, supplemental health protection plans (accident, critical illness, hospital indemnity), auto and home insurance, identity theft protection, legal counseling, long-term care coverage, moving assistance, pet insurance and more. \n  Free counseling services and resources for emotional, physical and financial wellbeing   \n  401(k) Plan with a 100% match on 3% to 9% of pay (based on years of service)   \n  Employee Stock Purchase Plan with 10% off HCA Healthcare stock   \n  Family support through fertility and family building benefits with Progyny and adoption assistance.   \n  Referral services for child, elder and pet care, home and auto repair, event planning and more   \n  Consumer discounts through Abenity and Consumer Discounts   \n  Retirement readiness, rollover assistance services and preferred banking partnerships   \n  Education assistance (tuition, student loan, certification support, dependent scholarships)   \n  Colleague recognition program   \n  Time Away From Work Program (paid time off, paid family leave, long- and short-term disability coverage and leaves of absence)   \n  Employee Health Assistance Fund that offers free employee-only coverage to full-time and part-time colleagues based on income. \n \n  Learn more about Employee Benefits \n  Note: Eligibility for benefits may vary by location. \n  You contribute to our success. Every role has an impact on our patients’ lives and you have the opportunity to make a difference. We are looking for a dedicated Electronic Processing Business Analyst like you to be a part of our team. \n  Job Summary and Qualifications \n \n  Job Summary – Documentation and analysis of system balancing, clean claim rates, payer acceptance rates, and system edit requests. Creation or modification of system billing edits to ensure appropriate claim results that meet payer, regulatory and provider requirements. Assist service centers, clients and payers regarding billing system processes and policies. The Electronic Processing (EP) Business Analyst is considered to be the subject matter expert and the liaison between the SSC’s and Relay Health. \n  A background and operational experience in Healthcare Revenue Cycle IT Solutions or Billing is recommended. Specific experience and understanding of HCA’s Revenue Cycle applications (i.e. Relay Health, Patent Accounting, eRequest and Artiva) is desirable. \n  Supervisor – Manager Billing Edits \n  Duties (included but not limited to): \n \n \n  Analyzes daily balancing exceptions by service center to determine bridge routine rules that resulted in the discarding of the claim, reports results to appropriate service centers and suggests modifications in the bridge routine rules to eliminate future balancing exceptions. \n  Provides balancing exception trending information to manager and director with comments regarding peaks and valleys in data. \n  Publishes balancing exception reports, including reasons for exceptions and service center responses on imaging storage system. \n  Analyzes daily released claims to determine payer acceptance percentages and rejection rates, reviews claim rejections to determine reason for rejection, reports rejections to the appropriate service centers and assists the service center billing director in creating edits to prevent future payer rejections. \n  Provides payer acceptance trending information to manager and director with comments regarding peaks and valleys in data. \n  Publishes service center payer acceptance/rejection logs on imaging storage system \n  Analyzes daily service center clean claim rates (claims submitted to billing system without errors) to identify trends and works with service center billing director in creation of bridge routine rules that result in higher clean claim rates. \n  Provides clean claim rate trending by service center and client to manager and director with comments regarding peaks and valleys in data. \n  Publishes service center daily claim submission reports on imaging storage system. \n  Monitors the edit requesting system for edit modification requests; reviews request for completeness, appropriateness and receipt of approvals. \n  Analyzes edit requests to determine type of edit modification required; logs service orders with billing vendor for supplemental/payer edits or creates/modifies bridge routine edits for provider edits. \n  Creates/Modifies bridge routine edits in the billing test system. \n  Creates testing scenarios for new or modified bridge routines that include before and after examples and negative testing that fully satisfies edit testing policies and procedures. \n  Publishes all testing documentation on imaging storage system. \n  Monitors billing system service orders system to ensure all requests are appropriately and timely resolved. \n  Routinely corresponds with service center billing director to validate services provided are meeting their needs. \n  Assists co-workers in completing work assignments as necessary to ensure a high level of service is provided by the department. \n  Maintains listing of all supplemental edits and activation criteria by service center location. \n  Travel to service centers and/or other facilities for onsite work may be required. \n  Must have strong documentation skills, organization skills, and the ability to interact with team members cross-functionally \n  Demonstrates a customer orientation; establishes and maintains strong relationships with business owners and develops a diverse network of relationships with various stakeholders. \n  Supports implementation projects, including training and communication. \n  Identifies impact of edit requests and works with stakeholders to identify options and recommendations. \n  Supports annual audit reviews (e.g. internal & external audit for Sarbanes Oxley, etc.) \n  Practice and adhere to the \"Code of Conduct\" philosophy. \n  Attend all required billing process education classes. \n  Other duties as assigned. \n \n  Knowledge, Skills & Abilities \n \n \n  Communication - communicates clearly and concisely, verbally and in writing. \n  Customer orientation - establishes and maintains long-term customer relationships, building trust and respect by consistently meeting and exceeding expectations. \n  Interpersonal skills - able to work effectively with other employees, patients and external parties. \n  PC skills - demonstrates proficiency in PC applications as required. \n  Policies and Procedures - demonstrates knowledge and understanding of organizational policies, procedures and systems. \n  Basic skills - able to perform basic mathematical calculations, balance and reconcile figures, punctuate properly, spell correctly and transcribe accurately. \n  Must have strong documentation skills, organization, and able to prioritize work. \n \n  EDUCATION \n \n \n  High school diploma or GED required. \n  Bachelor’s degree in information systems or healthcare-related field is preferred. \n  Relevant experience may substitute education requirements \n \n  EXPERIENCE \n \n \n  At least two years Parallon service center experience required. Emphasis on Billing or IT&S preferred. \n  Experience with ePremis, Relay Health and/or SSI billing vendor software. \n  Experience using SQL strongly preferred \n  Experience with Claim Update File (CUF) or XML is preferred. \n  Experience with professional and institutional claims \n  Proficient with Microsoft Office application such as Word, Excel, and Access. \n  Strong collaboration, facilitation, and data analysis skills \n  Working knowledge of the following applications: \n \n \n  Microsoft Office (Word, Excel, Access, Power Point) \n  Business Objects \n  Microsoft SharePoint \n \n \n   \n \n HealthTrust Supply Chain  is a critical part of HCA Healthcare’s strategy. Our focus is to  improve performance  and reduce costs. We do this by joining non-clinical and administrative functions. HealthTrust Supply Chain best practice methodologies. We develop, apply and monitor  cost-efficient initiatives  and programs for HCA Healthcare. By improving facility efficiency, medical professionals can focus on our mission - patient care. \n  HCA Healthcare has been recognized as one of the World’s Most Ethical Companies® by the Ethisphere Institute more than ten times. In recent years, HCA Healthcare spent an estimated $3.7 billion in cost for the delivery of charitable care, uninsured discounts, and other uncompensated expenses. \n \n \n \n \"Good people beget good people.\"- Dr. Thomas Frist, Sr.  HCA Healthcare Co-Founder \n We are a family 270,000 dedicated professionals! Our Talent Acquisition team is reviewing applications for our Electronic Processing Business Analyst opening. Qualified candidates will be contacted for interviews.  Submit your resume today to join our community of caring! \n  We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}, "72ed88f925190e3d": {"terms": ["machine learning engineer", "mlops"], "salary_min": 155800.0, "salary_max": 215500.0, "title": "Senior Software Engineer, ML Platform Infrastructure", "company": "Upstart Network, Inc.", "desc": "About Upstart \n  Upstart is a leading AI lending marketplace partnering with banks and credit unions to expand access to affordable credit. By leveraging Upstart's AI marketplace, Upstart-powered banks and credit unions can have higher approval rates and lower loss rates across races, ages, and genders, while simultaneously delivering the exceptional digital-first lending experience their customers demand. More than two-thirds of Upstart loans are approved instantly and are fully automated. \n  Upstart is a digital-first company, which means that most Upstarters can live and work anywhere in the U.S. We also have offices in San Mateo, California; Columbus, Ohio; and Austin, Texas. \n  Most Upstarters join us because they connect with our mission of enabling access to effortless credit based on true risk. If you are energized by the impact you can make at Upstart, we’d love to hear from you! \n \n \n \n The Team \n  Upstart's Machine Learning Platform team has a mix of professionals with different areas of deep expertise - from machine learning model development, training, and deployment, to cloud infrastructure, CI/CD, workflow orchestration, automation, and much more. The ML Platform team is responsible for ensuring we have a sound understanding of the model training and deployment lifecycle for various ML teams as we work to improve ML workflows across the company. \n  As a Senior Software Engineer on the ML Platform Infrastructure team, you’ll be responsible for building an MLOps platform that supports machine learning model development, training, process automation, deployment, and monitoring. Machine Learning is critical to Upstart’s core business, and our greatest competitive advantage lies in the fact that we’re able to innovate on our AI engine quickly. \n \n \n  Position Location -  This role is available in the following locations: Remote, San Mateo, Columbus, Austin \n \n \n  Time Zone Requirements -  This team operates across all U.S. time zones \n \n \n  Travel Requirements -  This team has regular on-site collaboration sessions. These occur 3-5 days per quarter at one of our office locations. If you need to travel to make these meetups, Upstart will cover all travel-related expenses. \n \n \n  How you’ll make an impact: \n \n Build, maintain, and monitor high-quality software applications that enable machine learning models to be applied to the ever-evolving needs of the business \n Develop the scaffolding and infrastructure that allows research scientists to iterate and train large scale machine learning models \n Enable research scientists to experiment rapidly and iterate on model training code so that we can continuously improve our models \n Work with data engineers, devops engineers, and research scientists to ensure that model training and deployment is a repeatable process that relies heavily on robots (not humans) \n \n \n \n  What we’re looking for: \n \n Minimum requirements: \n    \n 5+ years of software engineering experience \n Experience building and maintaining backend software services and APIs \n Experience with cloud compute, services, containerization, continuous integration and deployment (CI/CD) and testing frameworks \n Experience with some or many of the following: Python, Typescript, interactive notebooks (Jupyter/Sagemaker), and AWS  Good understanding of software development principles and best practices for creating scalable and maintainable systems  \n    \n Preferred qualifications: \n    \n Familiarity with cluster compute architectures (i.e.: Kubernetes) and serverless architectures (i.e. AWS Lambda, Batch) \n Excellent quantitative reasoning skills with interest in working at the intersection of engineering and machine learning \n Strong sense of ownership and accountability for the quality and timely delivery of work \n Proven ability to effectively analyze and solve complex problems \n Excellent written and verbal communication skills with stakeholders, peers and product owners \n Ability to thrive both in self-directed work environments and in collaborative settings, contributing positively to team dynamics \n \n \n \n What you'll love: \n \n Competitive Compensation (base + bonus & equity) \n Comprehensive medical, dental, and vision coverage with Health Savings Account contributions from Upstart \n 401(k) with 100% company match up to $4,500 and immediate vesting and after-tax savings \n Employee Stock Purchase Plan (ESPP) \n Life and disability insurance \n Generous holiday, vacation, sick and safety leave \n Supportive parental, family care, and military leave programs \n Annual wellness, technology & ergonomic reimbursement programs \n Social activities including team events and onsites, all-company updates, employee resource groups (ERGs), and other interest groups such as book clubs, fitness, investing, and volunteering \n Catered lunches + snacks & drinks when working in offices \n \n \n \n  #LI-REMOTE \n  #LI-MidSenior \n \n \n \n At Upstart, your base pay is one part of your total compensation package. The anticipated base salary for this position is expected to be within the below range. Your actual base pay will depend on your geographic location–with our “digital first” philosophy, Upstart uses compensation regions that vary depending on location. Individual pay is also determined by job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. \n  In addition, Upstart provides employees with target bonuses, equity compensation, and generous benefits packages (including medical, dental, vision, and 401k). \n \n \n     United States | Remote - Anticipated Base Salary Range\n    \n \n     $155,800—$215,500 USD\n    \n \n \n \n Upstart is a proud Equal Opportunity Employer. We are dedicated to ensuring that underrepresented classes receive better access to affordable credit, and are just as committed to embracing diversity and inclusion in our hiring practices. We celebrate all cultures, backgrounds, perspectives, and experiences, and know that we can only become better together. \n  If you require reasonable accommodation in completing an application, interviewing, completing any pre-employment testing, or otherwise participating in the employee selection process, please email  candidate_accommodations@upstart.com \n  https://www.upstart.com/candidate_privacy_policy"}, "88164085588c5baa": {"terms": ["machine learning engineer"], "salary_min": 173000.0, "salary_max": 241000.0, "title": "Production Engineer", "company": "Meta", "desc": "Production Engineers at Facebook are hybrid software/systems engineers who ensure that Facebook's services run smoothly and have the capacity for future growth. They are embedded in every one of Facebook's product and infrastructure teams, and are core participants in every significant engineering effort underway in the company.Our team is comprised of varying levels of experience and backgrounds, from new grads to industry. Relevant industry experience is important, but ultimately less so than your demonstrated abilities and attitude. We sail into uncharted waters every day at Facebook in Production Engineering, and we are always learning.This position is full-time.\n  \n \n \n Production Engineer Responsibilities:    \n \n Own back-end services like our Hadoop data warehouses, front-end services like Messenger and Newsfeed, infrastructure components like our Memcache infrastructure, and everything in between \n  Write and review code, develop documentation and capacity plans, and debug the hardest problems, live, on some of the largest and most complex systems in the world \n  Together with your engineering team, you will share an on-call rotation and be an escalation contact for service incidents \n  Partnered alongside the best engineers in the industry on the coolest stuff around, the code and systems you work on will be in production and used by millions of users all around the world \n \n \n \n \n Minimum Qualifications:   \n \n  Engineering, or a related technical discipline or equivalent experience \n  Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. \n  7+ years of experience in UNIX and TCP/IP network fundamentals \n  7+ years of coding experience \n  Experience learning development languages (PHP, Python, C++, and Java) \n  Experience learning software, frameworks and APIs \n  Experience performing 'guerilla capacity planning' for internet service architectures \n  Knowledge in internet service architectures (such as load balancing, LAMP, CDN’s) \n  Experience in configurating and maintaining of applications such as Apache, Memcached, Squid, MySQL, NFS, DHCP, NTP, SSH, DNS, and SNMP \n \n \n \n \n Preferred Qualifications:   \n \n  BS or MS in Computer Science \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "bf810854d9c06849": {"terms": ["machine learning engineer"], "salary_min": 143000.0, "salary_max": 204000.0, "title": "Software Engineer, Android", "company": "Meta", "desc": "Every month, billions of people access Facebook products using mobile devices from across the world. Our mobile teams constantly push the boundaries of the user experience across all our apps, including Facebook, Instagram, WhatsApp, Messenger, and more, as a leader in an exciting and fast-paced industry that is evolving daily. We are seeking full-time Android Software Engineers to join our mobile teams. As an Android Software Engineer, you will specialize in building elegant products on world-class technologies that bring our social experiences to billions of people, anytime and anywhere.We are looking for developers with experience in user interfaces, infrastructure, and/or tools supporting applications on Android using the Android SDK. If you are interested in joining a world-class team of passionate people and industry veterans who like to work hard and play hard, we look forward to hearing from you soon!\n  \n \n \n Software Engineer, Android Responsibilities:    \n \n Work closely with our product and design teams to build new and innovative application experiences for Android \n  Implement custom native user interfaces using the latest Android programming techniques \n  Build reusable Android software components for interfacing with our back-end platforms \n  Analyze and optimize UI and infrastructure application code for quality, efficiency, and performance \n \n \n \n \n Minimum Qualifications:   \n \n  Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. \n  5+ years of object-oriented software development experience \n  1+ years experience building Android applications in Java or Kotlin using Android SDK \n  Experience building maintainable and testable code bases, including API design and unit testing techniques \n  Experience with multithreading programming and mobile memory management \n \n \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "2b55584a5654527c": {"terms": ["machine learning engineer"], "salary_min": 173000.0, "salary_max": 241000.0, "title": "Product Security Engineer, Mobile", "company": "Meta", "desc": "Meta's Product Security team is seeking a passionate hacker who derives purpose in life by revealing potential weaknesses and then crafting creative solutions to eliminate those weaknesses. Your skills will be the foundation of security initiatives that protect the security and privacy of over two billion people. You will be relied upon to provide engineering and product teams with the web, mobile, or native-code security expertise necessary to make confident product decisions. Come help us make life hard for the bad guys.\n  \n \n \n Product Security Engineer, Mobile Responsibilities:    \n \n Engaging our teams to develop and deliver specific, multi-year roadmaps, programs, and projects. Ensure prioritization, resourcing, and timely delivery of this work within a changing business environment. \n  Automated Analysis and Secure Frameworks: build automation (static and dynamic analysis) and frameworks with software engineers that enable Meta to scale consistently across all of our products. \n  Developer Guidance: provide guidance and education to developers that help prevent the authoring of vulnerabilities. \n  Security Reviews: perform manual design and implementation reviews of products and services that make up the Meta ecosystem, like Instagram, WhatsApp, Oculus, Portal, and more. \n \n \n \n \n Minimum Qualifications:   \n \n  6+ years of experience reviewing Android/iOS applications. Knowledge of best practice secure code development \n  B.S. or M.S. in Computer Science or related field, or equivalent experience \n  Experience leading and managing complex cross-functional programs. \n  Experience with exploiting common security vulnerabilities. \n \n \n \n \n Preferred Qualifications:   \n \n  Experience writing software that enables security processes \n  Contributions to the security community (public research, blogging, presentations, bug bounty, etc.) \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "b1378526e2a2941c": {"terms": ["machine learning engineer"], "salary_min": 143000.0, "salary_max": 199000.0, "title": "Program Manager, Manufacturing", "company": "Meta", "desc": "Manufacturing is a pillar within Meta’s Preconstruction Team supporting datacenter construction. We exist to support the predictable delivery of capacity at scale through manufactured solutions.The Manufacturing Team’s primary focus is supply chain engagement and optimization. We accept Manufacturing Informed Designed (MID) components and orchestrate their detailing and prototyping to optimum manufacturability then work with our partners in Delivery to plan logistics and integration to avoid challenges in construction.This team is comprised of strategic designers, strategic builders, tactical specialists, plus internal and external subject matter experts (SME) including preconstruction managers, contractors, schedulers, equipment reliability engineers, and sourcing specialists.\n  \n \n \n Program Manager, Manufacturing Responsibilities:    \n \n Collaborate with Engineering on component manufacturing strategy then facilitate development of manufacturing models and drawings. \n  Develop budgets, negotiate, award communicate, contracts, and POs with supplier network. \n  Manufacturing execution including configuring supply chain, production, scheduling, strategic inventory, logistics, and integration in collaboration with our delivery and quality teams. \n  Supply chain and vendor management through execution (i.e. audits, troubleshooting, supplier annual reviews). \n  Develop First-of-Kind Component Standards in collaboration with Engineering, Design, and Quality (ex. logistics planning, advanced work packages, and QA & Cx strategies/procedures). \n  Track component manufacturing goals, KPI data, vendor performance metrics, stack ranking, and incentive program. \n  Manage the prototyping and mockup efforts with in-flight project sites including the communications with site teams, vendors, partners, and other stakeholder groups. This includes reporting on status, lessons learned, and adjustments needed to refine the designs of the components. \n  Identify and support assessment of new vendors to qualify, grow, evolve, and measure, for potential use in the program. \n  Research, assess, and report on vendor availability and potential throughput, project demand curves, and sourcing projections for components targeted for manufacturing. \n  Manage status updates on component development. \n  Research and report on industry trends as needed to support the team efforts. \n  Partner with cross functional teams on related efforts to ensure alignment and transparency across Design, Engineering, & Construction (DEC). \n  Partner with cross functional teams to assess cost and schedule impacts related to components and keep the team updated as to trends, risks, and other issues identified by this data. \n  Partner with vendors and cross functional partners to identify, track, and mitigate risks related to safety, quality, logistics, trucking/transportation, storage, etc. for components. \n  Partner closely with Sourcing Team for strategy and deployment of owner furnished equipment. \n  Partner with Global QA/QC Team to identify and strategically shift to the vendors and manufacturers, appropriate elements of the multi-trade integration and commissioning efforts to reduce onsite efforts. Your objective is to embed as much trade work and commissioning as is appropriate at the optimum points of fabrication from start through to the final point of integration. \n  Support team learning by bring lessons learned, vendors, new technology, and other topics to the group for exploration. \n  Support the use of LEAN, AGILE, SCRUM, etc. to continuously improve and evolve the efficiency of the team, partner groups, and vendors. \n  Travel approximately 40-60% Domestic Travel to construction and fabrication sites required (including minimal international travel as required). \n \n \n \n \n Minimum Qualifications:   \n \n  10+ years experience in construction, manufacturing, and/or project planning \n  Bachelor's Degree or 10+ years project managing Data Center Construction \n  Either or both experience in large scale construction management and/or scalable manufacturing \n  Manufacturing experience with understanding of lean manufacturing and supply-chain management plus knowledge of production machinery, processes, and standards in the field or industry experience with developing workflows and their associated flowcharts, schedules, and action plans \n  Proficient working knowledge of MS Word, Excel, PowerPoint, and Bluebeam \n \n \n \n \n Preferred Qualifications:   \n \n  Experience with off-site fabrication, pre-assembly and/or modularization of complex elements for construction [or off-shore] projects \n  Mission Critical, infrastructure, and/or data center construction experience \n  Experience working with blended architecture, engineering, manufacturing/assembly and construction teams \n  Experience with lean manufacturing and supply-chain management \n  Software experience with eBuilder, Procore, SolidWorks, Autodesk modeling software, Primavera P6, and/or BIM 360 \n  Basic knowledge of MS Visio and MS SharePoint \n  Experience with LEAN tools (such as Choosing by Advantage, Last Planner/Pull Planning, Gemba, Kanban) \n  Familiarity with Statistical Process Control (SPC), Just In Time (JIT) strategizing, and manufacturing data analytics \n  Experience with IPD projects \n  PMP Certification \n  Scrum Master Certification \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "b6f294ee6ca238c0": {"terms": ["machine learning engineer"], "salary_min": 196000.0, "salary_max": 269000.0, "title": "Display Imaging Pipeline Engineer", "company": "Meta", "desc": "At Meta Reality Labs, we’re developing the future of virtual reality (VR) and augmented reality (AR). The APIX team is looking for an Imaging Pipeline Engineer who can bring together the disparate simulation models of the component parts of our image chain, and employ this end-to-end pipeline in a continuous feedback loop to optimize product requirements against Display system constraints.\n  \n \n \n Display Imaging Pipeline Engineer Responsibilities:    \n \n Work cross-functionally with silicon, graphics, perception and display teams to implement pipeline models and simulate end-to-end performance of our image pipeline using those models \n  Implement system simulations of pipeline components and algorithms using a mixture of MATLAB and Python \n  Use simulation results to propose and verify improvements to aspects of the pipeline via modeling and human factors testing \n  Perform tradeoff analyses against visual quality metrics \n  Bring up novel display subsystems \n \n \n \n \n Minimum Qualifications:   \n \n  Bachelors in image processing or equivalent experience \n  8+ years of experience in research, advanced optics development, or equivalent experience \n  Experience in taking image-based (e.g. camera, printer, display) products to market \n  Experience with MATLAB \n  Understanding of Color spaces (HDR workflows, LED constraints, Display Calibration & Characterization) \n  Understanding of Imaging Standards such as SMPTE, MPEG & compressions schemes \n  Understanding of frame rates perception and hardware-software interactions \n  image processing algorithms and SW/HW implementation through the entire pipeline \n  Experience in managing production-level tradeoffs in typical image pipelines \n  Experience in working as part of a cross-functional team and familiarity with typical software/hardware design processes \n  Hands on working experience with displays and camera pipelines \n \n \n \n \n Preferred Qualifications:   \n \n  15+ years of experience in research, advanced optics development, or equivalent experience \n  PhD in Image Processing or related field \n  Knowledge of the human visual system, color science and imaging architectures \n  Experience in human factors testing and psychometric testing paradigms \n  Experience in bringing up real-world display technologies or optical systems, especially AR/VR \n  Experience with C/C++, C#, and/or Python and/or Matlab \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "ef0ca46db8edbb2a": {"terms": ["machine learning engineer"], "salary_min": 205000.0, "salary_max": 281000.0, "title": "Security Engineer, Internal Detection and Response", "company": "Meta", "desc": "Facebook's security team is the central engine driving data and systems security at the company, supporting Facebook and all of its family of apps. The organization is responsible for inhibiting malicious actors from compromising our environment, detecting and responding to them before they do damage if they do, ensuring we are maintaining the protections we say we will, and engaging with the community to help those outside the company learn from the work we do. We work across all parts of the company, from the corporate infrastructure to production to external services, interfacing with nearly every team in the company.\n  \n  Facebook's security team is looking for a Security Engineer with a variety of experiences in the discovery, containment, and mitigation of threat actors to work in the Internal Detection and Response team. A successful candidate will have experience establishing and maturing investigations and response efforts, drawing upon automation and cross functional partnerships to create scalable and resilient operational capabilities. We are building the next generation of security operations and response platforms to support the scale and security of Facebook. You will be helping to lead the programs where we are leveraging different sources of information for detecting, responding and investigating incidents and working with our software and production engineering teams to develop scalable systems to automate detection and remediation.\n  \n \n \n Security Engineer, Internal Detection and Response Responsibilities:    \n \n Influence and align the organization’s vision and strategy, while engaging our teams to develop and deliver specific, multi-year roadmaps, programs, and projects. Ensure prioritization, resourcing, and timely delivery of this work within a changing business environment. \n  Define operational metrics, key performance indicators, and service level objectives to assure the team achieves operational excellence. \n  Coach, mentor, support, and care for the team in a way that enables long-term career development, happiness, and success at scale. \n  Work with, partner, and influence other teams to solve challenges related to a broad spectrum of threat actors. \n  Build, cultivate, and maintain positive relationships with internal customers to identify and facilitate solutions to increase the impact of the team's work. \n  Be a broad technical and process subject matter expert regarding the services your team provides. \n  Collaborate with software and production engineering teams to develop scalable and flexible solutions for everything from low-level actors to nation state actors. \n  Focus on ruthlessly prioritizing, automating, and scaling every aspect of our detection and response capabilities. \n \n \n \n \n Minimum Qualifications:   \n \n  10+ years of work experience in software or security engineering \n  Experience developing and delivering information on program status for senior leadership \n  Experience leading and managing complex cross-functional programs \n  Knowledge of operating systems, file systems, and memory on Windows, MacOS, or Linux \n  Experience with an interpreted programming language (PHP, Python, Perl, Ruby, etc.) \n  Experience with attacker tactics, techniques and procedures \n \n \n \n \n Preferred Qualifications:   \n \n  Background in intrusion detection, security investigations, and incident response \n  Experience recruiting, building, and leading technical teams, including performance management \n  Experience “threat hunting”, i.e. using threat intel to proactively and iteratively investigate these potential risks and finding suspicious behavior in the network \n  Broad knowledge across the Security domain, as well as deep focus in one (or more) areas such as: Logs and events processing, Incident Management, and Detection and/or Response tool development \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "5d42d5a4fb4f9f49": {"terms": ["machine learning engineer"], "salary_min": 143000.0, "salary_max": 204000.0, "title": "Security Engineer, Program Analysis for Privacy Responsibilities", "company": "Meta", "desc": "Come make the world secure and private for billions of people by improving program analysis across all code and all developers at Meta. You will be part of a team that translates privacy and security needs into state of the art analyses, working closely with a team of software engineers that have been working on these problems for almost a decade. You will write new analyses and refine the results with meticulous attention to detail.You will also provide invaluable insights to the team on how to make our internal security products better. By doing this, you will enable everyone at Meta to move faster and be safer. Your work will form part of the foundation for scaling security and privacy at Meta.Join us.\n  \n \n \n Security Engineer, Program Analysis for Privacy Responsibilities Responsibilities:    \n \n Analyze recurring patterns in security and privacy issues surfaced by program analysis (eg. static analysis) tools, and identify opportunities for improvement \n  Partner with software engineers building these tools to set direction and implement the most broadly useful refinements \n  Support client teams applying our tools for their security and privacy use cases. Improve the results in a generalized way that benefits all future users \n  Mentor additional security engineers to scale yourself and the company \n \n \n \n \n Minimum Qualifications:   \n \n  5+ years’ experience in information security or privacy engineering role \n  Experience with identifying and remediating security or privacy issues in a web stack \n  Coding experience in one or more general purpose languages \n  Familiarity with program analysis tooling and frameworks (e.g. static analysis) \n \n \n \n \n Preferred Qualifications:   \n \n  Experience with delivering feedback to builders of program analysis tools to drive quality improvements \n  Experience with translating privacy commitment obligations into changes in code or architecture \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "c0847a52ca65366a": {"terms": ["machine learning engineer"], "salary_min": 143000.0, "salary_max": 204000.0, "title": "Senior Gameplay Programmer - Twisted Pixel Games", "company": "Oculus", "desc": "Oculus Game Studios is seeking an accomplished Gameplay Programmer to work with a team of experienced engineers on an unannounced VR game using the Unreal Engine. Candidates would be expected to work in several areas of game development, however would be primarily tasked with gameplay-related functionality.The ideal candidate will have excellent communication skills, a team-oriented, collaborative approach to development, and be experienced in many areas of game development—including programming tasks related to a variety of subjects such as physics, graphics, gameplay, networking, math, tools, etc. Candidates must be focused on the quality of their work, be able to learn quickly, be able to complete any programming task efficiently, and be able to grasp new technologies and concepts quickly.\n  \n \n \n Senior Gameplay Programmer - Twisted Pixel Games Responsibilities:    \n \n Implement gameplay related tasks \n  Perform research to acquire new knowledge necessary to perform assigned tasks \n  Design and develop technical features specific to the game \n  Design and develop game systems that contribute to the core technology framework \n  Work closely with game designers, producers, engineers, and artists to ensure the highest quality product \n  Put in the effort and time necessary to complete tasks in a timely fashion as well as making sure they are robust, expandable, and fun \n  Desire to put in the time and effort necessary to make a game great \n \n \n \n \n Minimum Qualifications:   \n \n  3+ years professional game programming experience or equivalent \n  Proven communication skills and experience working in a team environment \n  At least one proven shipped AAA console and/or VR title and/or equivalent \n  Proven C/C++ programming skills, and experience implementing complex systems \n  Bachelor's Degree in Computer Science or equivalent \n  Experience with Unreal Engine (UE4) \n \n \n \n \n Preferred Qualifications:   \n \n  Experience with C# for tools development \n  Experience with low level API’s \n  Experience with low level performance optimizations \n  Experience developing a multiplayer networked game \n  Experience working with a small team of programmers \n  Proven to be proactive about making things happen \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "3a3acd54b9391aed": {"terms": ["machine learning engineer"], "salary_min": 155000.0, "salary_max": 222000.0, "title": "Product Designer", "company": "Meta", "desc": "At Meta, we’re shaping innovative experiences in service of giving people the power to build community and bring the world closer together. Our multidisciplinary design teams are creating new ways to help people connect, find communities and grow businesses. Together, we are committed to building innovative technologies — Facebook, Instagram, Messenger, WhatsApp, Workplace, Meta Quest and more — to serve billions of people around the globe. As a product designer at Meta, you’ll have the opportunity to play a central role in the way we build technologies — ensuring they are valuable, easy to use and of the highest level of craft and execution. You’ll be involved in every aspect of the product development process, from brainstorming the next great product innovation to tweaking pixels right before launch. We’ll expect you to utilize your full range of product design, interaction design and visual design skills, while contributing to high-level strategic decisions with product and executive partners. Join a diverse group of thinkers and do some of the most meaningful work of your career. This posting represents different full-time roles across the Meta company.\n  \n \n \n Product Designer Responsibilities:    \n \n Leads and delivers design projects of large and (or) ambiguous scope \n  Take broad, conceptual ideas and turn them into something useful and valuable for our 2 billion plus users \n  Design flows and experiences that simplify and distill down complex actions into usable interfaces \n  Design new experiences or layouts that evolve and define visual systems \n  Contribute to strategic decisions around the future direction of Facebook products \n  Give and solicit feedback from designers and a broader product team in order to continually raise our bar for quality, while also taking on mentorship \n  Lead a partnership with product managers, engineers, researchers and content strategists to oversee the user experience of a product from conception until launch \n \n \n \n \n Minimum Qualifications:   \n \n  6+ years of experience building, shipping and leading applications or software that are large and/or ambiguous in scope that encompass an end-to-end experience across a variety of platforms. \n  6+ years of interaction design experience with knowledge of defining how an experience should behave based on understanding people's needs, plus consideration of how this innovation will scale. Use appropriate prototyping tools to demonstrate how a particular flow or interaction will work. \n  6+ years of visual design experience with proficiency in typography, desktop/mobile UI, color, layout, iconography and aesthetic sense and how these elements impact product function. \n  6+ years of experience driving the vision of a successful product playing a critical role in setting goals and direction while making decisions that reach a common goal based on the impact to people and the company. \n  Experience representing work to a broader product team and other leaders, clearly and succinctly articulating the goals and concepts. \n \n \n \n \n Preferred Qualifications:   \n \n  Experience showcasing your end-to-end design process across multiple projects, that include interaction and visual design artifacts, multiple iterations, and high-fidelity prototypes \n  Experience connecting your work with other related initiatives across the company while driving collaboration \n  Proven leadership in non-product dimensions that have made a team stronger and positively impacted the work environment \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "11debe2181a2ae24": {"terms": ["machine learning engineer"], "salary_min": 205000.0, "salary_max": 281000.0, "title": "Network Security Engineer", "company": "Meta", "desc": "Metas’ Network Security team is seeking an experienced engineer to help secure our global Data Centers, Backbone, Optical Infrastructure, and PoP networks. We do this by working extensively across the Meta family of products, including Facebook, Messenger, Instagram, WhatsApp, and Oculus where we identify and solve security problems across network infrastructure. You will be setting direction and influencing engineering teams to develop security controls and services that will protect network infrastructure which helps serve traffic for over 3 billion users worldwide.We are looking for a candidate with a passion for security and innovation, who will research and develop new solutions to help protect our infrastructure and our users through a defense in-depth approach. Candidates should thrive on finding security issues and eradicating them as well as a desire to make life hard for bad actors. With focuses that range from large scale DDoS, routing security, security tool development, defense against internal and external attacks there’s lots of room to push your skill set beyond simply protecting the network with firewalls.\n  \n \n \n Network Security Engineer Responsibilities:    \n \n Identifying risks across network infrastructure that would lead to the exposure of sensitive data, unauthorized access, or loss of availability and prioritizing remediation efforts to address gaps. \n  Influence security direction of network hardware, software and infrastructure to protect the network integrity of Meta platforms. \n  Conceptualize and lead efforts towards building sustainable and scalable network layer security controls and tooling. \n  Mentor and evangelize security practices through cross functional work with engineering teams throughout Meta. \n  Keep Meta safe through active operation and defense of critical network infrastructure. \n \n \n \n \n Minimum Qualifications:   \n \n  Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. \n  10+ years of experience in offensive/defensive security, or systems engineering. \n  Experience leading complex cross-functional programs. \n  Experience with an interpreted or compiled programming language (Python, GO, C++, etc). \n  Knowledge of network protocols (TCP/IP, computer networking, routing and switching), and Unix based systems. \n \n \n \n \n Preferred Qualifications:   \n \n  Experience researching, building and implementing defensive security controls which defend against internal and external attack vectors. \n  Experience leveraging layered security models to defend critical network infrastructure. \n  Experience evaluating and testing new vendor platforms and in house network initiatives for security issues. \n  Expertise in understanding threat models to better protect against attacks or detect new vectors. \n  Strong understanding of implementation and scaling of access controls across both host and network layers. \n  Experience leading network efforts to investigate, prevent, and mitigate security incidents. \n  Develop automation and utilize frameworks to scale both protection and mitigation tools beyond doing everything manually or repetitively (ex. I process/make firewall changes, vs. I built or used a system to scale and make multiple changes). \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "0d67b35da7020d26": {"terms": ["machine learning engineer"], "salary_min": 172994.0, "salary_max": 241000.0, "title": "Graphics Software Engineer, Rendering - Reality Labs", "company": "Meta", "desc": "Reality Labs at Meta is building products that make it easier for people to connect with the ones they love most, enjoy top-notch, wire-free VR, and push the future of computing platforms. We are a team of world-class experts developing and shipping products at the intersection of hardware, software and content.As a Graphics Software Engineer on the Reality Labs team at Meta, you can help build new, innovative hardware and software that radically redefine the way people work, play and connect. What we build today could one day be the norm. So to be here today is to truly be at the heart of change and the frontier of what's to come. We're the people helping to define the metaverse. We may not have all the answers. But together, we're getting closer.\n  \n \n \n Graphics Software Engineer, Rendering - Reality Labs Responsibilities:    \n \n Develop innovative graphics frameworks, algorithms, and tools to maximize graphics quality and performance \n  Partner closely with various infra and product teams across Meta, on camera, graphics, upcoming hardware, media enhancements, and more to create real-time rendering architecture \n  Building tools and pipelines for generating very realistic synthetic images \n  Enable high fidelity experiences through remote compute solutions on smaller devices with limited battery \n  Building rendering subsystems for platforms such as Spark AR and Horizon \n  Build a platform for cloud streamed games \n  Document and support graphics features \n  Write high-quality, performant, and maintainable code \n  Collaborate with cross-functional engineering teams to deliver innovation into AR/VR products \n \n \n \n \n Minimum Qualifications:   \n \n  Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. \n  6+ years of graphics software engineering experience or 2+ years of graphics software engineering experience with PhD \n  6+ years of experience with C/C++ programming \n  6+ years of object-oriented and component-based design experience \n  Problem-solving and communication skills \n \n \n \n \n Preferred Qualifications:   \n \n  Experience delivering AAA Games, working on Graphics subsystems or the Game Engine AR/VR experience \n  Knowledge of ray tracing, rasterization and linear algebra \n  Experience with low level performance profiling and optimization \n  Experience implementing 3D graphics features such as lighting, effects, shaders and other low-level systems \n  Experience with tools such as Maya, Houdini, Blender, 3Ds Max, Arnold, RenderMan, or Cycles \n  Experience with either DirectX/Vulkan/OpenGL/Metal \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "71d5fc1db17904a0": {"terms": ["machine learning engineer"], "salary_min": 189000.0, "salary_max": 260000.0, "title": "Product Design Leader", "company": "Facebook App", "desc": "At Meta, we’re shaping innovative experiences in service of giving people the power to build community and bring the world closer together. Our multidisciplinary design teams are creating new ways to help people connect, find communities and grow businesses. Together, we are committed to building innovative technologies — Facebook, Instagram, Messenger, WhatsApp, Workplace, Meta Quest and more — to serve billions of people around the globe. Meta is looking for a Product Design Leader with exceptional design, communication and people management skills. As a Product Design Leader, you will lead and manage teams to ensure our products and features are valuable for people, easy to use, and of the highest level of craft and execution. In this role, you'll be a foundational member on the leadership team, working together with your counterparts in engineering, data science, UX research, content design, and other disciplines to define the strategy, operations and communications that guide the team to build great products addressing real user needs. You’ll be expected to utilize your full range of people management skills, product strategy, product design, interaction design and visual design skills. This posting represents different full-time roles across the Meta company.\n  \n \n \n Product Design Leader Responsibilities:    \n \n Build and manage a talented, diverse, inclusive team of product designers and leaders that consistently delivers on projects and is well-balanced across a range of design skill sets \n  Responsible for overall team performance and health, resource allocation, project prioritization, and building a culture of design excellence \n  Lead and oversee the user experience of a product from conception to launch in partnership with product managers, engineers, UX researchers and content designers \n  Take broad, conceptual ideas and turn them into useful and valuable products for our billions of users \n  Contribute to strategic decisions around the future direction of Meta’s products \n  Design end-to-end flows and experiences that are simple and elegant for our supported platforms \n  Define, craft and evolve designs within visual systems and/or standard \n  Proactively solicit and provide feedback from designers and a broader product team in order to continually raise our bar for quality, while also taking on mentorship \n  Cultivate a healthy design process for the team, and be a key contributor to your organization's product strategy \n  Effectively communicate your team's product goals (both within the team and outside the team), and connect related projects across the company so that problems or joint decisions can be resolved quickly \n \n \n \n \n Minimum Qualifications:   \n \n  8+ years of experience in Product Design \n  4+ years of design leadership experience with direct reports under your guidance and leadership \n  8+ years of experience working collaboratively with product, engineering, design, content and user research teams \n  Experience building and shipping applications or software across a variety of platforms \n  Experience leading product direction and strategic thinking with the experience developing product goals, identify opportunities, and make decisions based on the impact to people and the company \n  Experience representing work to a broader product team and other leaders, clearly and succinctly articulating the goals and concepts \n \n \n \n \n Preferred Qualifications:   \n \n  Experience with delivering 0-1 products from concept stages to launch \n  Experience working on large scale, complex, ambiguous projects across multiple teams \n  Experience managing managers \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "9948c5ae6231bbfa": {"terms": ["machine learning engineer"], "salary_min": 155000.0, "salary_max": 222000.0, "title": "Product Designer - Reality Labs", "company": "Meta", "desc": "At Reality Labs, we bring together the brightest cross-disciplinary minds in one place to deliver our mission: build tools that help people feel connected, anytime, anywhere. Developers, researchers, engineers and designers all working together to help build a more expansive – and more inclusive – future for all of us.As a Product Designer, you’ll be responsible for defining, designing, researching, prototyping, and implementing new features as well as future iterations. We're looking for a designer who isn't afraid to jump in and explore new challenges. You have a balance of interaction design, visual design, and product thinking skills. You are customer obsessed and research driven. You’re a natural collaborator and can work independently and in a team environment.\n  \n \n \n Product Designer - Reality Labs Responsibilities:    \n \n Take broad, conceptual ideas and turn them into something useful and valuable for people using our products \n  Work collaboratively with Product, Research, Engineering and other partners from concept to completion \n  Drive planning, strategy and vision on key priorities across cross-functional teams \n  Own the end-to-end design (user flows, interaction, visual, etc.) across multiple products and projects \n  Present designs, prototypes and concepts to cross functional partners and stakeholders \n  Provide implementation guidance to engineers and ensure features launch at the highest quality \n  Clearly articulate design decisions to a vast set of internal stakeholders across Reality Labs and Meta \n \n \n \n \n Minimum Qualifications:   \n \n  8+ years of industry experience designing software products \n  Experience working in a technical environment \n  Experience utilizing research and data to drive product strategy and decision making \n  A portfolio of work that demonstrates a breadth of user experience, interaction and visual design skills \n \n \n \n \n Preferred Qualifications:   \n \n  Experience designing products for virtual, augmented, mixed reality and/or other emerging technologies \n  Experience working with cross-functional stakeholders such as User Research, Engineering, and Product Management \n  Experience prototyping 3D interactions or interfaces using Unity \n  Experience with novel user inputs such as hand or eye tracking \n  Experience designing products for developers and/or creators \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "1deafa7e6732412f": {"terms": ["machine learning engineer"], "salary_min": 110471.56, "salary_max": 139881.61, "title": "Software Engineer - Identity Experiences, Health", "company": "Cash App", "desc": "Company Description\n   It all started with an idea at Block in 2013. Initially built to take the pain out of peer-to-peer payments, Cash App has gone from a simple product with a single purpose to a dynamic ecosystem, developing unique financial products, including Afterpay/Clearpay, to provide a better way to send, spend, invest, borrow and save to our 47 million monthly active customers. We want to redefine the world’s relationship with money to make it more relatable, instantly available, and universally accessible.    Today, Cash App has thousands of employees working globally across office and remote locations, with a culture geared toward innovation, collaboration and impact. We’ve been a distributed team since day one, and many of our roles can be done remotely from the countries where Cash App operates. No matter the location, we tailor our experience to ensure our employees are creative, productive, and happy.    Check out our locations, benefits, and more at cash.app/careers. \n \n \n \n Job Description\n   About  Health \n  Cash App has grown rapidly to tens of millions of users moving billions of dollars daily. To support this, we are building out Health — a new Platform organization responsible for product experiences aimed at promoting the health of the increasingly complex Cash App ecosystem. Health works to improve Cash App access for our customers, while limiting access for bad or unauthorized users by detecting and preventing improper use across all of our core product areas. The teams under Health creating these mission critical services and products include Identity, Access, Risk Controls and Support Automation. \n  We appreciate broad perspectives, a willingness to dive deep, and a readiness to work collaboratively across many disciplines (including product, design, operations, legal, data science, ML). \n  About Identity Experiences \n  The Identity Experiences team is a server engineering team that works cross-functionally with a variety of disciplines — mobile/client engineering, design, product, data science, and compliance. \n  Cash App is building the most relatable, instantly available, and universally accessible financial app in the world. This team's mission is to create a customer identity and limits system to support Cash App's growth, while maintaining high levels of customer trust. We work with some of our customers' most sensitive data, and we take privacy and security seriously. \n  As a member of the Cash App Identity team, you will: \n \n  Design, build and support the core systems used to manage identity on Cash App \n  Work with cross-functional partners to build an increasingly intuitive and low friction identity verification system that can achieve global scale. \n  Work with cross-functional partners to build the least intrusive and easiest to understand limits system in any financial app \n  Creatively solve challenging technical problems at scale \n  Leverage industry-leading identify verification technologies \n  Be involved in defining and implementing an expanding roadmap \n  Be on a team that is part of a 24/7 on-call support roster for our services \n \n \n \n \n Qualifications\n   You have: \n \n  BA/BS in computer science or equivalent experience \n  2+ years working on complex systems and delivering quality software \n  Strong programming skills, with fluency in at least one programming language \n  Solid understanding of software development and testing best practices \n  Strong problem-solving skills and the ability to debug complex software issues \n  Worked on systems where data consistency and availability is required \n  Demonstrated experience working collaboratively in cross-functional teams \n  Willingness to learn, adapt and stay up to date with industry trends, emerging technologies and regulatory requirements \n \n  You may also have: \n \n  Knowledge of identity verification concepts such as KYC (Know Your Customer), AML (Anti-Money Laundering) and document verification \n  Experience working with data infrastructures, SQL and NoSQL databases (design, querying, performance optimization) \n  Familiarity with machine learning concepts for data analysis and fraud detection \n \n  Technologies we use and teach: \n \n  Java, Kotlin \n  JUnit, Hibernate, Guice \n  HTTP, JSON, gRPC, and Protocol Buffers \n  Datadog \n  MySQL \n  Amazon Web Services \n  Kafka and event driven architecture \n \n  Additional Information\n   Block takes a market-based approach to pay, and pay may vary depending on your location. U.S. locations are categorized into one of four zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.    Zone A: USD $152,100 - USD $185,900  Zone B: USD $144,500 - USD $176,700  Zone C: USD $136,900 - USD $167,300  Zone D: USD $129,300 - USD $158,100 \n \n  To find a location’s zone designation, please refer to this resource. If a location of interest is not listed, please speak with a recruiter for additional information. \n  Full-time employee benefits include the following: \n \n  Healthcare coverage (Medical, Vision and Dental insurance) \n  Health Savings Account and Flexible Spending Account \n  Retirement Plans including company match \n  Employee Stock Purchase Program \n  Wellness programs, including access to mental health, 1:1 financial planners, and a monthly wellness allowance \n  Paid parental and caregiving leave \n  Paid time off (including 12 paid holidays) \n  Paid sick leave (1 hour per 26 hours worked (max 80 hours per calendar year to the extent legally permissible) for non-exempt employees and covered by our Flexible Time Off policy for exempt employees) \n  Learning and Development resources \n  Paid Life insurance, AD&D, and disability benefits \n  Additional Perks such as WFH reimbursements and free access to caregiving, legal, and discounted resources \n \n  These benefits are further detailed in Block's policies. This role is also eligible to participate in Block's equity plan subject to the terms of the applicable plans and policies, and may be eligible for a sign-on bonus. Sales roles may be eligible to participate in a commission plan subject to the terms of the applicable plans and policies. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans. \n  We’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, veteran status, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. \n  We believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible.  Want to learn more about what we’re doing to build a workplace that is fair and square? Check out our  I+D page . \n  Additionally, we consider qualified applicants with criminal histories for employment on our team, assessing candidates in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance. \n \n \n  Block, Inc. (NYSE: SQ) is a global technology company with a focus on financial services. Made up of Square, Cash App, Spiral, TIDAL, and TBD, we build tools to help more people access the economy. Square helps sellers run and grow their businesses with its integrated ecosystem of commerce solutions, business software, and banking services. With Cash App, anyone can easily send, spend, or invest their money in stocks or Bitcoin. Spiral (formerly Square Crypto) builds and funds free, open-source Bitcoin projects. Artists use TIDAL to help them succeed as entrepreneurs and connect more deeply with fans. TBD is building an open developer platform to make it easier to access Bitcoin and other blockchain technologies without having to go through an institution."}, "ffdafcc02c67f146": {"terms": ["machine learning engineer"], "salary_min": 205000.0, "salary_max": 281000.0, "title": "Production Engineer", "company": "Meta", "desc": "Production Engineers at Meta are hybrid software/systems engineers who ensure that Facebook's services run smoothly and have the capacity for future growth. They are embedded in every one of Facebook's product and infrastructure teams, and are core participants in every significant engineering effort underway in the company.Our team is comprised of varying levels of experience and backgrounds, from new grads to industry veterans. Relevant industry experience is important, but ultimately less so than your demonstrated abilities and attitude. We sail into uncharted waters every day at Facebook in Production Engineering, and we are always learning.This position is full-time.\n  \n \n \n Production Engineer Responsibilities:    \n \n Write and review code, develop documentation, operability features, capacity plans, and debug the hardest problems, live, on some of the largest and most complex systems in the world \n  Partner with the best engineers in the industry on some of the highest scale stuff around, the code and systems you work with are full production systems supporting our billions of users all around the world, with APIs consumed directly or indirectly by most engineering teams across the company \n  Drive improvements in efficiency, operability, scalability, performance, security and privacy across multiple distributed teams while merging their systems into a single sustainable global storage fabric \n \n \n \n \n Minimum Qualifications:   \n \n  Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. \n  10+ years of experience in UNIX and TCP/IP network fundamentals \n  10+ years of coding experience \n  Experience performing 'guerilla capacity planning' for internet service architectures \n  Experience learning development languages (PHP, Python, C++, and Java) \n  Experience learning software, frameworks and APIs \n  Knowledge in internet service architectures (such as load balancing, LAMP, CDN’s) \n  Experience in configurating and maintaining of applications such as Apache, Memcached, Squid, MySQL, NFS, DHCP, NTP, SSH, DNS, and SNMP \n \n \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "687b20d6244b2b1a": {"terms": ["machine learning engineer"], "salary_min": 143000.0, "salary_max": 204000.0, "title": "Senior Server Engineer - BigBox", "company": "Oculus", "desc": "Big Box VR, makers of POPULATION: ONE, is seeking a Senior Server Software Engineer who can help build the next generation of games for Virtual Reality. You have multiple years of experience running web services in production and have working knowledge of server-based multi-user game engineering design.We are looking for a strong communicator who loves the iterative technical and creative process. This person will have the desire to understand a product holistically and can contribute creatively, knowing when to be pragmatic and when to be blue sky. This person will make engineering trade-offs that align with business objectives while embracing teamwork, as well as solve problems independently.\n  \n \n \n Senior Server Engineer - BigBox Responsibilities:    \n \n Create, maintain and deploy highly reliable web services within a highly dynamic and iterative team environment \n  Design, develop, test and maintain quality code and documentation \n  Work as a team, contributing to important design decisions and conversations \n  Develop prototypes and experiments, while researching and recommending novel ideas, new tools, and technologies \n  Setup and maintain monitoring, alerting, and instrumentation for key services \n  Test, support, and secure games as a service \n  Collaborate with artists and engineers to implement new developments, help build features, and solve creative problems \n \n \n \n \n Minimum Qualifications:   \n \n  4+ years of professional software development experience \n  Experience running a live web service that can scale horizontally \n  Demonstrated experience working in self-managed, fast-paced environments \n  Experience learning new programming languages, systems, and devices \n  Experience completing a ship cycle for a product \n  Bachelor in Computer Science/Electrical Engineering or equivalent experience \n \n \n \n \n Preferred Qualifications:   \n \n  Experience with PHP/Hack, Python, C# and the .NET runtime \n  Experience with Unity3D \n  Experience with AWS and GameLift \n  Strong background in AR or VR \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "f79c4ab3f4a66b2b": {"terms": ["machine learning engineer"], "salary_min": 143000.0, "salary_max": 204000.0, "title": "Security Engineer, Incident Management & Regulatory Compliance", "company": "Meta", "desc": "Meta Security is looking for an Security Engineer with experience in the identification, containment and mitigation of security incidents, along with experience working with audit and compliance team. You will be helping to lead discussions and represent XDR as part of our first line of defense with audit and regulatory consumers. In this role you will build a broad level of awareness and expertise in the people, process, and technological solutions that Meta has created to protect and defend our user data and company from threats. You will also be working with our software and production engineering teams to develop scalable systems to automate evidence collection and continuous monitoring.\n  \n \n \n Security Engineer, Incident Management & Regulatory Compliance Responsibilities:    \n \n Lead compliance evidencing and scoping for detection and response in a cross-functional environment. \n  Represent the Detection and Response pillars as part of the first line of defense with auditors and regulators, sharing your technical and policy/governance expertise. \n  Design, establish and maintain continuous monitoring of key controls and evidence on behalf of the XDR team. \n  Embed with our Detection Engineering and Response teams to develop and then represent a deep understanding of our people, process and technologies in place to secure our user data and platforms. \n  Perform security incident root cause analysis and drive implementation of containment and mitigation strategies. \n \n \n \n \n Minimum Qualifications:   \n \n  7+ years of experience in Security Incident Response and Detection & Response Engineering. \n  Knowledge of compliance and regulatory frameworks such as GDPR, EEPC, or PCI. \n  Knowledge of operating systems, file systems, and memory structures on Windows, macOS and Linux. \n  Experience investigating and responding to both external and insider threats. \n  Coding/scripting experience in one or more general purpose languages. \n  Experience with attacker tactics, techniques, and procedures. \n  Bachelor's degree or equivalent experience in Security. \n \n \n \n \n Preferred Qualifications:   \n \n  Experience as a Lead Security Incident Responder and Investigator in a large and regulated organization. \n  2+ years of experience working with audit/regulatory frameworks as a Security subject matter expert. \n  Broad knowledge across the Security domain, as well as deep focus in one (or more) areas such as Logs and events processing, Incident Management, Digital Forensics, Detection and/or response tool development. \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "98a49654e0ff7264": {"terms": ["machine learning engineer"], "salary_min": 173000.0, "salary_max": 241000.0, "title": "Senior Software Engineer - Oculus Studios Central Technology", "company": "Oculus", "desc": "Oculus Studios is expanding the Central Technology team (OSCT) focusing on efforts for the First Party Game Studios (Armature Studios, Beat Games, BigBox VR, Camouflaj, Downpour Interactive, Ready At Dawn Studios, Sanzaru Games, Twisted Pixel, Supernatural).Within OSCT, we help our Studios take advantage of the economies of scale that Meta provides. We are looking for engineers who can work effectively within Meta’s vast infrastructure and are excited by the chance to help Studios make video games.We collaborate to build core systems and shared technologies for the Studios. Working with partners across Meta, we assist in migrating and onboarding our partner studios with common Meta supported solutions.\n  \n \n \n Senior Software Engineer - Oculus Studios Central Technology Responsibilities:    \n \n Help define and establish Meta's infrastructure approach for game studios - working across multi-year effort \n  Find common needs by working across the first party game studios collecting requirements and proposing solutions to gain buy-in. Build shipping features as part of a 1st Party product and launch to consumers. Learn from those launches and bring back institutional knowledge to apply to the next 1st Party engagement. \n  Build custom solutions that align with the Metaverse (e.g. Avatars, Common Identity, Integrity) that are delivered to consumers by launching games that use those features. \n  Work as a full-stack developer and gain familiarity in multiple coding languages as needed: e.g. CPP, C#, Python, Hack, JavaScript, React \n  Be or become familiar with multiple game engines: i.e. Unity, Unreal, proprietary engine \n  Be or become familiar with multiple 3rd Party Game technologies (i.e. AWS GameLift, Unity Vivox) \n  Gain familiarity of alternate hosting environments (i.e. cloud/corporate/lab) and help determine where and how they should be used \n  Help onboard new game studios engineers to Meta infra and internal tools, while bringing empathy for game development back to core Meta teams \n  Partner with other teams within Meta to figure out best approaches to migrate game studio services while bringing the Meta focuses of reliability, scalability, security to the game studio space \n  Support game studios during break/fix scenarios and be part of the escalation path \n  Assist game studios in building, scaling, and optimizing new features for their existing/future titles \n \n \n \n \n Minimum Qualifications:   \n \n  Experience in learning new approaches, coding languages, and Meta specific solutions \n  5+ years of experience in developing backend services for games and/or enterprise (large scale distributed environments) \n  Experienced with C/C++ or C \n  Broad knowledge of games and game development and/or enterprise scale infrastructure \n  Experienced with Python and / or PowerShell \n  Experienced collaborating with team members across multiple disciplines to bring products to life \n \n \n \n \n Preferred Qualifications:   \n \n  Experience with General Frameworks: GraphQL, Graph API, Ent Framework \n  Shipped AAA titles or Large enterprise solution \n  Experience working in major game engines (i.e. Unreal, Unity) \n  Experience as a Full-Stack developer in a large scale distributed environment \n  Experience with backend security, privacy, scalability, and persistence storage design paradi \n  Experience in building user facing tools using languages such as Hack, JavaScript, React, etc. \n  Experience building supportable solutions that include proactive alerting, monitoring, and product metrics \n  Experience with major cloud providers (AWS, Azure, etc.) \n  Experience working with distributed computing platforms \n  Bachelor's Degree in Computer Science or Engineering \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "24359c30ac34f084": {"terms": ["machine learning engineer"], "salary_min": 180700.0, "salary_max": 250000.0, "title": "Principal Analytics Engineer", "company": "Upstart Network, Inc.", "desc": "About Upstart \n  Upstart is a leading AI lending marketplace partnering with banks and credit unions to expand access to affordable credit. By leveraging Upstart's AI marketplace, Upstart-powered banks and credit unions can have higher approval rates and lower loss rates across races, ages, and genders, while simultaneously delivering the exceptional digital-first lending experience their customers demand. More than two-thirds of Upstart loans are approved instantly and are fully automated. \n  Upstart is a digital-first company, which means that most Upstarters can live and work anywhere in the U.S. We also have offices in San Mateo, California; Columbus, Ohio; and Austin, Texas. \n  Most Upstarters join us because they connect with our mission of enabling access to effortless credit based on true risk. If you are energized by the impact you can make at Upstart, we’d love to hear from you! \n \n \n \n The Team and Role \n  Our team designs and develops robust and scalable data models for analytics and machine learning stakeholders to empower them to retrieve meaningful insights. Our Analytics Engineering team is centralized within the company and partners closely with data engineering, data platform, software engineers, ML engineers and cross functional analytics squads to stitch together datasets to create data models that are ready for consumption. \n  In addition to architecting data models, we implement Analytics Engineering best practices around Data Governance, Data Quality, Data Orchestration and pipeline optimization. We enable analysts to think like software engineers by defining, documenting and ensuring adoption of best practices when making contributions to the analytical code-base. \n \n \n  Position Location -  This role is available in the following locations: San Mateo, California; Columbus, Ohio; Austin, Texas; Remote USA \n  Time Zone Requirements -  This team operates on the East/West Coast time zones. \n  Travel Requirements -  This team has regular on-site collaboration sessions. These occur 3 days per Quarter at alternating Upstart office locations. If you need to travel to make these meetups, Upstart will cover all travel related expenses. \n \n \n  How you’ll make an impact: \n \n Formulate a technical vision and roadmap for analytics engineering at Upstart \n Understand how data is produced and consumed at a deep level - you will need to be extremely collaborative with the teams that produce and consume the data to create an end-to-end solution that maximizes the value of our data \n Having an impact on the software engineering, analytics, and machine learning organizations by educating them on data architecture practices that improve the data landscape across the entire company \n Be a close strategic partner to analytics squads to participate in decision making on the analytics road map for Upstart \n \n \n \n  What we’re looking for: \n \n Minimum requirements: \n    \n 10+ years of experience as a Data Engineer / Analytics Engineer / BI Engineer \n Strong understanding of data modeling concepts in both transactional and analytical databases \n Proven ability to design and implement the data architecture at an organizational level to lead to better outcomes for producers and consumers of the data \n Excellent communication and collaboration skills, particularly when explaining technical or complex matters to less technical co-workers \n \n Preferred qualifications: \n    \n Familiarity with business intelligence visualization tools such as Looker, Tableau, Power BI, etc. \n Experience with cloud computing platforms like AWS, Azure, Google Cloud \n Thorough understanding of data lake/warehouse architectures (BigQuery, Databricks, Redshift) \n Experience prioritizing goals based on the larger picture, while being comfortable getting into the details as needed \n \n \n \n What you'll love: \n \n Competitive compensation (base + bonus & equity) \n Comprehensive medical, dental, and vision coverage with Health Savings Account contributions from Upstart \n 401(k) with 100% company match up to $4,500 and immediate vesting and after-tax savings \n Employee Stock Purchase Plan (ESPP) \n Life and disability insurance \n Generous holiday, vacation, sick and safety leave \n Supportive parental, family care, and military leave programs \n Annual wellness, technology & ergonomic reimbursement programs \n Social activities including team events and onsites, all-company updates, employee resource groups (ERGs), and other interest groups such as book clubs, fitness, investing, and volunteering \n Catered lunches + snacks & drinks when working in offices \n \n \n \n  #LI-REMOTE \n  #LI-MidSenior \n \n \n \n At Upstart, your base pay is one part of your total compensation package. The anticipated base salary for this position is expected to be within the below range. Your actual base pay will depend on your geographic location–with our “digital first” philosophy, Upstart uses compensation regions that vary depending on location. Individual pay is also determined by job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. \n  In addition, Upstart provides employees with target bonuses, equity compensation, and generous benefits packages (including medical, dental, vision, and 401k). \n \n \n     United States | Remote - Anticipated Base Salary Range\n    \n \n     $180,700—$250,000 USD\n    \n \n \n \n Upstart is a proud Equal Opportunity Employer. We are dedicated to ensuring that underrepresented classes receive better access to affordable credit, and are just as committed to embracing diversity and inclusion in our hiring practices. We celebrate all cultures, backgrounds, perspectives, and experiences, and know that we can only become better together. \n  If you require reasonable accommodation in completing an application, interviewing, completing any pre-employment testing, or otherwise participating in the employee selection process, please email  candidate_accommodations@upstart.com \n  https://www.upstart.com/candidate_privacy_policy"}, "75046b2731934cbf": {"terms": ["machine learning engineer"], "salary_min": 133000.0, "salary_max": 190000.0, "title": "Enterprise Systems Engineer", "company": "Meta", "desc": "Enterprise Engineering is looking for Systems Engineers. Our customers are Facebook’s employees, and we support the systems they rely on to keep the business growing and information safe. We use a combination of open source and off-the-shelf technologies, plus many of the tools developed to run Facebook. You will be responsible for growing the Linux environment by solving configuration, authentication, and infrastructure problems at scale.\n  \n \n \n Enterprise Systems Engineer Responsibilities:    \n \n Build, scale, and secure Facebook’s corporate infrastructure, focusing specifically on the Linux environment \n  Combine open-source and commercial technologies to build services that will have an impact on the business \n  Work in a heterogeneous environment containing diverse operating systems and applications, and make them work well together \n  Apply modern engineering methodologies such as infrastructure as code, Linux container orchestration, and software-defined storage to scale Facebook's rapidly growing Enterprise infrastructure \n  Find ways to leverage the scale and complexity of the larger Facebook infrastructure to solve problems for Enterprise customers \n  Be the final escalation point for issues related to Enterprise Linux systems \n  Produce systems that are scalable, automated, and well-documented, and train others to take on operations \n \n \n \n \n Minimum Qualifications:   \n \n  BS in Computer Science, Engineering, or a related technical discipline or equivalent experience \n  5+ years system administration experience working in a Linux environment \n  5+ years experience in shell scripting \n  5+ years experience coding in at least one of the following languages: PHP, Ruby, Python, or Go \n  5+ years experience working with monitoring and configuration management tools such as Puppet and Chef \n \n \n \n \n Preferred Qualifications:   \n \n  Experience supporting configuration management in a multi-region environment \n  Experience building services \n  Experience building PaaS or internal clouds \n  Experience with job schedulers (Kubernetes, Slurm, etc) \n  MS in Computer Science \n \n \n \n \n About Meta:    Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n  \n \n \n \n  Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment. \n   \n  Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com."}, "4cc5c30c2673e2c3": {"terms": ["mlops"], "salary_min": 123058.01, "salary_max": 155818.86, "title": "Senior DevOps Engineer", "company": "Nagarro", "desc": "Full-time \n  Service Region: Eastern Europe \n \n \n \n \n \n  Company Description \n \n \n  We are a digital product engineering company that is scaling in a big way! We build products, services, and experiences that inspire, excite, and delight. We work at scale — across all devices and digital mediums, and our people exist everywhere in the world (19,000+ experts across 35 countries, to be exact). Our work culture is dynamic and non-hierarchical. We're looking for great new colleagues. That's where you come in! \n  By this point in your career, it is not just about the tech you know or how well you can code. It is about what more you want to do with that knowledge. Can you help your teammates proceed in the right direction? Can you tackle the challenges our clients face while always looking to take our solutions one step further to succeed at an even higher level? Yes? You may be ready to join us \n \n \n \n \n \n  Job Description \n \n \n  We are looking for an Senior DevOps Engineer having 4-6 years’ experience with Docker, CI/CD, Cloud Migration- General Experience. \n  WHAT ARE YOUR RESPONSIBILITIES: \n \n  Focus on automating various aspects of the software development lifecycle, including code integration, testing, deployment, and infrastructure provisioning,  CI/CD \n  Maintain and optimize  Docker  containers for various applications and services. \n  Implement monitoring and logging solutions to track the performance and health of applications and infrastructure. Respond to incidents and troubleshoot issues quickly. \n  Facilitate collaboration between development and operations teams by promoting a culture of communication and shared responsibility. \n  Maintain clear and up-to-date documentation of infrastructure configurations, deployment processes, and best practices. \n \n \n \n \n \n \n  Qualifications \n \n \n \n  Strong problem-solving skills and attention to detail. \n  Expertise in Docker. \n  CI/CD \n  Cloud Migration - General Experience. \n  Excellent communication and teamwork skills."}, "adfae793b903458c": {"terms": ["mlops"], "salary_min": 115000.0, "salary_max": 120000.0, "title": "DevOps Engineer", "company": "Alamo Drafthouse", "desc": "Alamo Drafthouse is seeking a DevOps Engineer to operate as a vital contributor in the dynamic, fast-paced environment of our combined restaurant and cinema experience. This is an exciting opportunity to play an influential role on the Alamo Drafthouse Technology team and help to transform our digital platform experience. Bringing a security-conscious mindset to everything you do, your role encompasses a broad spectrum of responsibilities, including enhancing CI/CD pipelines, automating operations and services, and contributing to various infrastructural projects. As a member of several cross-functional teams, you will collaborate to build an agile and secure operational framework, keeping abreast of the latest in DevOps methodologies and tools.\n  \n \n \n  OUR MISSION \n \n \n   To Ensure EVERY Guest and Teammate Has An AWESOME Experience And Is EXCITED To Come Back\n  \n What We Offer (Benefits) \n \n  Salary Range: $115K - $120K per year \n  Annual Bonus \n  Direct deposit \n  Free movies & discounted food and drinks  \n Paid time off \n  Medical, dental, vision \n  FSA and/or HSA \n  Voluntary benefits are available for all full-time teammates \n  A fun workplace where you can be yourself and do awesome work! \n \n  Core Role Responsibilities \n \n  Uphold standards of behavior as defined by the company Core Values, Code of Conduct and Operational Guidelines \n  Be a key contributor to securing our computing infrastructure while aiding in both existing and evolving infrastructural projects \n  Leverage cloud services and leading automation tools to facilitate secure and efficient operations \n  Assist in the deployment and fine-tuning of CI/CD pipelines, shorten the systems development life cycle and provide continuous delivery of high-quality software \n  Collaborate in agile ceremonies, product ideation and software development planning to heighten security standards without compromising agility \n  Develop and maintain detailed documentation, encapsulating security guidelines to aid teams and promote a secure operational flow \n  Engage proactively with cross-functional teams to identify and address security concerns, fostering a secure and agile work environment \n \n  Qualifications \n \n  3-5+ years of hands-on, professional experience in DevOps environments, including administration of cloud services, security compliance and successful audit, and support of multiple development teams \n  3-5+ years of practical experience in working with or supporting CI/CD pipelines and cloud infrastructure management \n  Experience in scripting and systems automation, demonstrated ability to balance agility and security \n  Expertise in the utilization of DevOps tools such as Jenkins, Terraform, Chef, K8s, along with a readiness to deepen your understanding of Scala, SBT, and Maven \n  Proactive, growth-oriented mindset, showing readiness to adapt and uphold high security and quality standards in all initiatives \n  Commit to occasional on-call duties, being available to address urgent concerns and sustain our security and operational standards \n \n  Our Core Values \n \n  DO THE RIGHT THING -  We strive to be a force of good in our company, in our industry and in the world. We stand up for our beliefs even when it is hard. We start from a place of kindness. \n \n \n \n  FOSTER COMMUNITY -  We value what is unique about each other and celebrate our differences. We treat each other with respect, support each other’s passions, and help each other grow. We welcome healthy debate but don’t tolerate intolerance. We take this commitment outside our 4 walls, creating neighborhood theaters that are deeply tied to the local community. \n \n \n \n  BOLDLY GO -  Like the crew of the Starship Enterprise™, we seek out new experiences and pursue innovation in all of our work. We take risks and chart new territory. We learn from our mistakes and continuously improve. \n \n \n \n  GIVE A SH!T -  We are passionate about creating awesome experiences. We obsess over every detail and take pride in our work because we know it makes all the difference to our guests and our teammates. Our pursuit of excellence drives us to do our best."}, "c52cb392430781b8": {"terms": ["mlops"], "salary_min": 30.0, "salary_max": 35.0, "title": "AWS DevOps Engineer", "company": "High5Hire", "desc": "This is a  remote role  for  12 months  in the  Unites States.  Please only apply if you have the following work authorization: \n \n US Citizen \n Green Card (GC) \n Green Card (GC) - EAD \n H-4 EAD \n \n The pay rate for this position is  $30-$35 per hour. \n Required Experience: 3-5 years \n Required Skills: \n \n Functional Testing \n Automation \n Selenium \n Manual \n \n Looking for a talented and experienced Kubernetes / AWS EKS and AWS ECS Containerization Engineer to join our dynamic team and play a critical role. \n As a Kubernetes and Containerization Engineer, you will be responsible for designing, implementing, and maintaining our containerization and orchestration infrastructure using Kubernetes and related technologies. \n Work closely with cross functional teams to enable the deployment and scaling of applications in a containerized environment. \n Qualifications : \n \n 3+ years experience in designing, implementing, and maintaining AWS EKS / Kubernetes clusters. \n 4+ years experience in Containerization technologies, especially Docker. \n 3+ years experience in Container Orchestration tools with a focus on AWS ECS or AWS EKS. \n 4+ years of experience in writing shell and python scripts. \n 3+ years experience in cloud platforms AWS. \n 4+ years of experience in CI/CD tools like Jenkins and Bamboo. \n 4+ years of experience in source code repositories like Bitbucket, GitHub, Maven. Certified Kubernetes Administrator are a plus. \n \n Responsibilities: \n \n Design and Implement Kubernetes / AWS EKS / AWS ECS clusters Architect and deploy Kubernetes clusters to support application workloads. \n Configure and optimize cluster resources for high availability and performance. \n Create Docker containers for applications and services. \n Develop and maintain containerization best practices. \n Manage container orchestration using Kubernetes. \n Implement and optimize Kubernetes resources such as Pods, Deployments, and Services. \n Collaborate with DevOps teams to integrate containerization into CI/CD pipelines. \n Automate deployment, scaling, and management of containerized applications. \n Implement monitoring solutions to ensure the health of containerized applications. \n Troubleshoot and resolve issues related to containers and Kubernetes clusters. \n \n Job Type: Contract \n Salary: $30.00 - $35.00 per hour \n Compensation package: \n \n Hourly pay \n \n Experience level: \n \n 3 years \n 4 years \n 5 years \n \n Application Question(s): \n \n Do you have the following any of the following: Green Card (GC), Green Card (GC) - EAD, H-4 EAD or are a US Citizen? (Yes/No) - Please answer this question as we will not be able to move forward with your profile if it is blank - thank you. \n \n Experience: \n \n Azure: 2 years (Required) \n AWS: 3 years (Required) \n Kubernetes: 3 years (Required) \n \n Work Location: Remote"}, "f3642ca14a40a982": {"terms": ["mlops"], "salary_min": 114666.266, "salary_max": 145193.05, "title": "Lead AWS DevOps Engineer", "company": "Xactus", "desc": "Are you currently seeking a position that will challenge you and support your professional development? Are you looking for a company that is growing and changing the face of its industry? \n Xactus (pronounced ‘Zac-tus’) is the leading verification innovator for the mortgage industry. We have over 6,500 clients ranging from the largest bank and non-bank mortgage originators to credit unions and mortgage brokers. With 12 operation centers across the U.S., Xactus works closely with our clients to digitally integrate a 360° approach to verification across their workflows. As a result, lenders can easily access the technology necessary to meet consumer demands for a modern mortgage experience with industry-leading speed, reliability, and accuracy – while also closing more loans more quickly with greater profitability. \n We provide a friendly work environment while also providing many opportunities for you to enhance your skills. We have a top-notch financial leadership team who prioritizes building talent. If you are curious and searching for a change that will be fun and rewarding, please reach out to us! We would love to have you on our team! \n SUMMARY : \n We are seeking an experienced Lead AWS DevOps Engineer to take charge of our DevOps strategies and infrastructure. The ideal candidate will have a proven track record in AWS DevOps, with the ability to create sophisticated CI/CD pipelines and automate a variety of development and testing activities. This role is hands-on and requires an expert-level understanding of the AWS ecosystem, with a strong capability to work autonomously in a dynamic and fast-paced environment. Immediate problem identification and remediation are key aspects of this role. \n ESSENTIAL DUTIES AND RESPONSIBILITIES \n \n Design, implement, and manage CI/CD pipelines for a range of projects on AWS. \n Automate development, testing, and deployment processes to enhance efficiency \n  and reliability.\n  \n \n Work closely with the development team to integrate new deployment processes \n  and strategies.\n  \n \n Oversee the management of AWS resources and ensure proper infrastructure setup for high availability, scalability, and resilience. \n Lead the charge on incident management and response, quickly addressing and remediating any issues that arise. \n Proactively monitor system performance, troubleshoot issues, and participate in \n  the resolution of outages.\n  \n \n Keep up to date with the latest AWS services and best practices, implementing them \n  to improve our services continually.\n  \n \n Collaborate with the Chief Architect to align DevOps strategies with company goals. \n Guide and mentor team members, fostering an environment of continuous improvement and learning. \n \n \n \n This position is remote."}, "fd5d8a38e31fb535": {"terms": ["mlops"], "salary_min": 133055.44, "salary_max": 168477.84, "title": "(Remote) Senior DevOps Engineer", "company": "SAP", "desc": "We help the world run better \n  Our company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from. Apply now! \n \n  We are an innovative technology company seeking to redefine the boundaries of technological advancement. Our ideal candidate is a Senior DevOps Engineer with substantial expertise in cloud automation. We champion those who take initiative, think creatively, and drive continuous improvement. \n \n  **Job Description:** \n  We are seeking a seasoned Senior DevOps Engineer to take the lead in optimizing our operational processes and application deployment architecture. The role involves integrating advanced cloud-based technologies and working closely with our dynamic team. Key responsibilities include implementing and refining DevOps best practices, deploying and automating cloud-based solutions, and assisting in architectural planning to ensure scalability and reliability of our systems. \n \n  **Key Responsibilities:** \n \n \n  Design and implement continuous delivery systems and methodologies on cloud platforms. \n Automate our operations and processes using advanced scripting languages. \n Develop and implement infrastructure as code for environment setup, management, and teardown, ensuring a smooth transition from development to production. \n Collaborate with development and operations teams to enhance efficiency and effectiveness of the CI/CD pipeline. \n Leverage Terraform for management and scaling of cloud-based resources. \n Utilize Git for version control and source code management. \n Monitor system performance proactively, troubleshoot issues, and ensure system stability and scalability. \n Conduct system troubleshooting and problem-solving across platform and application domains. \n Implement stringent cloud security measures to safeguard critical system components. \n \n \n  **Qualifications:** \n \n \n  Bachelor's Degree in Computer Science, Information Technology, or related field. Master's degree preferred. \n 5-7 years of experience in a DevOps role or similar, with demonstrated success in software deployment. \n Deep understanding of cloud architecture and substantial experience with cloud services (AWS, Google Cloud, Azure). \n Proficiency in Terraform, Git, and other infrastructure and deployment tools. \n Experience with scripting languages (Python, Bash). \n Advanced knowledge of continuous integration and continuous delivery (CI/CD) methodologies. \n Proficiency in SAP HANA and SAP SAC is a substantial advantage. \n Excellent problem-solving skills and keen attention to detail. \n Superior verbal and written communication skills. \n Ability to manage multiple tasks and projects simultaneously. \n \n \n  **Why Work With Us:** \n \n  We offer a collaborative, innovative work environment where each team member's contribution is valued. Our benefits package includes competitive salary, comprehensive health coverage, and substantial opportunities for professional growth and development. \n \n  If you possess the right mix of skills, experience, and passion for technological innovation, we encourage you to apply. \n \n  We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. \n \n  Note: This position is available for remote work or in-office arrangements. We look forward to hearing from you! \n \n  We build breakthroughs together \n \n  SAP innovations help more than 400,000 customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with 200 million users and more than 100,000 employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, we build breakthroughs, together. \n  We win with inclusion \n  SAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.  SAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com.  For SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training. \n  EOE AA M/F/Vet/Disability \n  Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability. \n  Compensation Range Transparency : SAP believes the value of pay transparency contributes towards an honest and supportive culture and is a significant step toward demonstrating SAP’s commitment to pay equity. SAP provides the annualized compensation range inclusive of base salary and variable incentive target for the career level applicable to the posted role. The targeted combined range for this position is $113,900 - $239,300 USD. The actual amount to be offered to the successful candidate will be within that range, dependent upon the key aspects of each case which may include education, skills, experience, scope of the role, location, etc. as determined through the selection process. Any SAP variable incentive includes a targeted dollar amount and any actual payout amount is dependent on company and personal performance. Please reference this link for a summary of SAP benefits and eligibility requirements: SAP North America Benefits. \n  Requisition ID: 382044 | Work Area: Software-Development Operations | Expected Travel: 0 - 10% | Career Status: Professional | Employment Type: Regular Full Time | Additional Locations: #LI-Hybrid"}, "metadata": {"keywords": ["data science", "data analyst", "data engineer", "machine learning engineer", "mlops"], "locations": ["remote"], "time_ran": "10:13:19-12-11-23", "num_jobs": 51, "timings": {"start_drivers": 44.28802537918091, "find_job_ids": 8.573110342025757, "get_job_descs": 22.528837203979492}}}